[
  {
    "title": "Barbell Jammers",
    "id": "f6f96da9-5880-4fac-ab57-67f785f7f153",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Place the end of a standard barbell in a corner so that it will not move unnecessarily, place a weight on one end of the barbell with a collar so that the weight can not fall off during the exercise.  Stand with your feet slightly wider than shoulder-width, your toes pointed forward or slightly outward facing the end of the barbell so that it is between both feet and directly under your center of gravity."
      },
      {
        "title": "Step 2",
        "description": "Squat down by first shifting your hips backwards then downwards to create a hinge-like movement at your knees, as you lower your hips the knees will then start to shift forward slowly, but try to control the amount of forward translation (movement) of the tibia (shinbone). Brace your core to keep your trunk stable and spine straight. Continue to lower yourself until your thighs are near, or parallel with the floor, or until your heels begin to lift off the floor, or until your torso begins to round or flex forward.  Lift the end of the barbell and firmly grasp it in both hands using a closed grip (thumbs wrapped around the bar). Position the end of the bar directly in front of your chest directly under your chin. Maintain your body position with the spine in neutral (normal-to-flat), shoulders depressed (no shrugging) with scapulae retracted (squeezing shoulder blades together). Keep your chest held up and out, head in line with your spine or slightly extended (raised), heels on the floor, and shoulders over or slightly in front of the bar. Your eyes should be facing forward or slightly upward."
      },
      {
        "title": "Step 3",
        "description": "Upward phase:  Push your feet into the ground and drive your hips forward to extend your legs and begin the upward phase of the movement by standing up while continuing to hold the end of the barbell in front of your chest.  Monitor your feet, ankles and knees; to maintain control of your feet and knees push the floor away from you while keeping your knees aligned over the second toe of each foot as you move up to a standing position."
      },
      {
        "title": "Step 4",
        "description": "As you approach a full standing position quickly push through your heels, extending and pushing the hips towards an upright position, begin to press the end of the barbell upwards with both hands continuing to grip the end of the bar, stiffen your core and abdominal muscles (“bracing”) to stabilize your spine."
      },
      {
        "title": "Step 5",
        "description": "As the hips and knees reach full extension, continue pushing upward onto your toes at the ankle while pressing the bar overhead into full extension. The movement for the bar should start at the hips, travel through the trunk and continue through the shoulders and arms. Avoid arching your back during the overhead push. Roll up on your toes as you move your legs into triple extension (ankle plantarflexion, knee and hip extension)."
      },
      {
        "exerciseTip": "Start with light resistance then gradually progress this exercise by increasing the weight and increasing the pace of the exercise so that you begin to perform the movement explosively against heavier resistance. Technique is very important in this lift. Do not progress to explosive movements until you master your technique."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Full Body/Integrated, Legs - Calves and Shins, Legs - Thighs, Shoulders",
    "category": [
      "Abs",
      "Butt/Hips",
      "Full Body/Integrated",
      "Legs - Calves and Shins",
      "Legs - Thighs",
      "Shoulders"
    ],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/236-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/236-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/236-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/236-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/236-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/236-6.jpg"
    ]
  },
  {
    "title": "Bird-dog",
    "id": "8bbe516e-fb65-447f-830c-e849e95338cf",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on an exercise mat or floor, positioning your knees and feet hip-width apart, with your feet dorsi-flexed (toes pointing towards your body)."
      },
      {
        "title": "Step 2",
        "description": "Slowly lean forward to place your hands on the mat, positioning them directly under your shoulders at shoulder-width with your fingers facing forward. Reposition your hands and knees as necessary so that your knees are directly under your hips and hands are directly under your shoulders."
      },
      {
        "title": "Step 3",
        "description": "Stiffen your core and abdominal muscles to position your spine in a neutral position, avoid any excessive sagging or arching."
      },
      {
        "title": "Step 4",
        "description": "Upward Phase: This exercise involves simultaneous movement of your leg and contralateral (opposite) arm. This exercise is best performed facing a mirror. Hip Extension: Slowly extend your left hip (raise and straighten the knee) attempting to extend it until it is at, or near parallel, to the floor without any rotation in the hip. Your goal is to keep both hips parallel to the floor. The use of a light bar placed across the hips, parallel to the waistline of your pants, provides visual feedback to hip rotation and what corrections are needed."
      },
      {
        "title": "Step 5",
        "description": "Shoulder flexion: Slowly flex your right arm (raise and straighten the arm) attempting to raise it until it is at, or near parallel, to the floor without any tilting at the shoulders. Your goal is to keep the both shoulders parallel to the floor. The use of a light bar placed across the shoulders provides visual feedback to shoulder rotation and what corrections are needed. Your head should remain aligned with the spine throughout the movement."
      },
      {
        "exerciseTip": "The bird-dog is an excellent exercise to train the body how to stabilize the lumbar spine (low back) during upper and lower extremity movement. Never exceed your body's capacity to control movement in the low back."
      }
    ],
    "bodyPart": "Abs, Back, Butt/Hips",
    "category": ["Abs", "Back", "Butt/Hips"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/14-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/14-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/14-3.jpg"
    ]
  },
  {
    "title": "Bodyweight Squat",
    "id": "c8d7b8b3-4722-4b34-bd4a-8e146e3c1eea",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Begin standing with your feet slightly wider than hip-width, with the toes turned slightly outwards with your hands by your sides so the palms facing inwards. Depress and retract your scapulae (pull the shoulders down and back)."
      },
      {
        "title": "Step 2",
        "description": "Stiffen your core and abdominal muscles (“bracing”) to stabilize your spine. Hold your chest up and out, tilt your head slightly up, shift your weight back into your heels while pushing your hips towards the wall behind you."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Start the downward phase by first shifting your hips backwards then downwards to create a hinge-like movement at your hips and knees simultaneously. As you lower your hips the knees will then start to shift forward slowly, but try to control the amount of forward translation (movement) of the tibia (shinbone). Maintain tension in the core muscles (continue bracing) and attempt to keep your back flat."
      },
      {
        "title": "Step 4",
        "description": "Continue to lower yourself until your thighs are parallel or almost parallel with the floor, until your heels begin to lift off the floor, or until your torso begins to round or flex forward. Monitor your feet, ankles and knees, ensuring that the feet don't move, the ankles do not collapse in or out and the knees remain aligned over the second toe."
      },
      {
        "title": "Step 5",
        "description": "From the Lowered Position: the knees should continue to remain aligned over the second toe and body weight should be evenly distributed between the balls and heels of the feet. From the side, the position of the tibia (shinbone) and torso should be parallel with each other and the low back should appear flat or showing the beginning of some rounding."
      },
      {
        "exerciseTip": "Think about inhaling on the way down and exhaling while exerting on the way back to the initial standing position."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Calves and Shins, Legs - Thighs",
    "category": [
      "Abs",
      "Butt/Hips",
      "Legs - Calves and Shins",
      "Legs - Thighs"
    ],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/135-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/135-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/135-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/135-4.jpg"
    ]
  },
  {
    "title": "BOSU® Lateral Jumps",
    "id": "419c7b05-f9a8-459c-bd9d-9fdb74bec2b4",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Place a BOSU® balance trainer on the floor 3-6\" to your left on a non-slip surface. Stand with your feet hip-width apart or closer, arms by your sides, depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Begin your downward phase by first shifting your hips backwards then slowly moving downwards to create a hinge-like movement at your knees. Continue to lower yourself until your feel your heels about to lift off the floor. Try to maintain a flat back by bending forward at the hips, keep your head facing directly forward and position to your arms where comfortable or where they offer the greatest degree of balance support."
      },
      {
        "title": "Step 3",
        "description": "Jumping Movement: With ONLY a very brief pause at the bottom of your downward phase, explode sideways (left) and upwards through your lower extremity onto the top of the BOSU, achieving triple extension (pushing and extending your ankles, knees and hips simultaneously). As your jump into the air, try to keep your feet level with each other and parallel with the floor, but bring them together to land on the top of the BOSU."
      },
      {
        "title": "Step 4",
        "description": "Landing: The most important components of the landing phase on a BOSU are correct foot position and avoiding excessive forward movement in your lower extremity which places additional stresses upon your knees."
      },
      {
        "title": "Step 5",
        "description": "Attempt to land softly and quietly on the mid-foot, rolling backwards quickly towards the heels to create a level foot, parallel with the floor. Always push your hips backwards and drop your hips to absorb the jumping forces. Avoid locking out your knees or quads on your landing as this may lead to potential knee injuries."
      },
      {
        "exerciseTip": "Before attempting to jump laterally onto the BOSU, learn first how to squat and perform regular squat jumps, BOSU squat jumps and lateral cone jumps."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "BOSU Trainer",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/119-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/119-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/119-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/119-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/119-5.jpg"
    ]
  },
  {
    "title": "BOSU® Squat Jumps",
    "id": "0fe429cf-f244-4048-95c2-69c9f923ddd5",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Place a BOSU® balance trainer on the floor 3-6\" in front of your feet on a non-slip surface. Stand with your feet hip-width apart or closer, arms by your sides, depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Begin your downward phase by first shifting your hips backwards then slowly moving downwards to create a hinge-like movement at your knees. Continue to lower yourself until you feel your heels about to lift off the floor. Try to maintain a flat back by bending forward at the hips, keep your head facing the BOSU directly and position to your arms where comfortable or where they offer the greatest degree of balance support."
      },
      {
        "title": "Step 3",
        "description": "Jumping Movement: With ONLY a very brief pause at the bottom of your downward phase, explode upwards through your lower extremity onto the top of the BOSU, achieving triple extension (pushing and extending your ankles, knees and hips simultaneously). As your jump into the air, keep your feet level with each other and parallel with the floor, but bring them together to land on the top of the BOSU."
      },
      {
        "title": "Step 4",
        "description": "Landing: The most important components of the landing phase on a BOSU are correct foot position and avoiding excessive forward movement in your lower extremity which places additional stresses upon your knees."
      },
      {
        "title": "Step 5",
        "description": "Attempt to land softly and quietly on the mid-foot, rolling backwards quickly towards the heels to create a level foot, parallel with the floor. Always push your hips backwards and drop your hips to absorb the jumping forces. Avoid locking out your knees or quads on your landing as this may lead to potential knee injuries."
      },
      {
        "exerciseTip": "It is suggested, you first learn how to squat and perform regular squat jumps before attempting to jump onto the BOSU."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "BOSU Trainer",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/117-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/117-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/117-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/117-4.jpg"
    ]
  },
  {
    "title": "Childs Pose",
    "id": "9ee7d38f-ea4a-458c-9fc1-4c957f0ca535",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel with both knees directly under your hips and feet plantar flexed (toes pointing behind you) with the big toes touching. Begin to widen your knees towards the outside of the mat. Stiffen your abdominal muscles (“brace”) to stabilize your spine, and depress and retract your scapulae (pull shoulders down and back) without arching your low back. Slowly lean forward placing your hands on the ground, positioning them directly under your shoulders with your fingers facing froward. Inhale."
      },
      {
        "title": "Step 2",
        "description": "Keeping your hands planted, exhale and hinge at the hips, bringing your glutes to your heels. As you sit back, maintaining the connection between your glutes and heels, extend through your back and arms. Pull the shoulders down and back keeping them away from the ears. Allow your chest to rest between your thighs and your forehead to rest on the floor. Inhale as you lengthen the spine, extending through the upper body, and exhale as you fold deeper into the pose, widening the knees as needed."
      },
      {
        "title": "Step 3",
        "description": "Hold this position for 5-10 slow, deep breaths (approximately 30 seconds to a minute)."
      },
      {
        "title": "Step 4",
        "description": "Exercise variation: Extend your arms alongside the body with the palms facing upward and the fronts of your shoulders toward the floor."
      },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Abs, Back, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Back", "Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/227-1.jpg"
    ]
  },
  {
    "title": "Cobra Exercise",
    "id": "41e73051-db8f-49d8-9ff0-a60057dc751f",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie prone (on your stomach) on an exercise mat or floor with your hands by your sides, positioned directly under your shoulders and hands facing forward. Extend your legs and plantar flex your ankles (toes point away from body)."
      },
      {
        "title": "Step 2",
        "description": "Upward Phase: Gently exhale and press your hips into the mat or floor and pull your chest away from the ground while keeping your hips stable. This will arch your low back and stretch the muscles in your chest and abdominal region. Hold this position for 15 - 30 seconds"
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Gently relax and lower your upper body to rest back upon the mat or floor."
      },
      {
        "title": "Step 4",
        "description": "If you experience any pain in the low back with this movement, stop the exercise immediately and consult with your doctor."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "As the length of arms differ, individuals may often lift their hips off the mat or floor as they fully extend their arms. In this case, limit the extension in your arms to keep the hips on the mat."
      }
    ],
    "bodyPart": "Abs, Back",
    "category": ["Abs", "Back"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/16-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/16-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/16-3.jpg"
    ]
  },
  {
    "title": "Crunch",
    "id": "180187d3-d948-417a-925a-747834449269",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie in a supine (on your back) position on a mat with your knees bent, feet flat on the floor and heels 12 - 18\" from your tailbone."
      },
      {
        "title": "Step 2",
        "description": "Place your hands behind your head, squeezing your scapulae (shoulder blades) together and pulling your elbows back without arching your low back. This elbow position should be maintained throughout the exercise. Align your head with your spine, but allow it to move into slight flexion (moving the chin towards the chest) during the upward phase of the exercise."
      },
      {
        "title": "Step 3",
        "description": "Upward Phase: Exhale, contract your abdominal and core muscles and flex your chin slightly towards your chest while slowly curling your torso towards your thighs. The movement should focus on pulling your rib cage towards your pelvis (the neck stays relaxed while the chin is tucked towards the neck). Your feet, tailbone and lower back should remain in contact with the mat at all times. Continue curling up until your upper back is lifted off the mat. Hold this position briefly."
      },
      {
        "title": "Step 4",
        "description": "Downward Phase: Gently inhale and slowly uncurl (lower) your torso back towards the mat in a controlled fashion keeping your feet, tailbone and low back in contact with the mat."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Proper form is important for this exercise to prevent excessive stress on your low back. Individuals usually perform this movement too rapidly and recruit the hip flexors to assist with the upward phase. This technique tilts the pelvis anteriorly, increasing the stress on the low back and should be avoided. The abdominals connect the rib cage to the pelvis so the movement should focus on bringing these two body parts closer together while keeping the neck and shoulders relaxed."
      }
    ],
    "bodyPart": "Abs",
    "category": ["Abs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/52-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/52-2.jpg"
    ]
  },
  {
    "title": "Decline Plank",
    "id": "2ec7c293-6146-472a-b18a-6d700fc485ea",
    "description": "With the feet close together on top of the BOSU dome, place the elbows on the ground underneath the shoulders with the hands in fists. Squeeze the muscles of the stomach and glute, and keep the body in a straight line from head to heels. Hold this position for the desired amount of time.",
    "bodyPart": "Abs",
    "category": ["Abs"],
    "equipment": "BOSU Trainer",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/304-1.jpg"
    ]
  },
  {
    "title": "Dirty Dog",
    "id": "e21f560a-a2de-4147-b5e6-2a3a3f02b3f9",
    "description": [
      {
        "title": "Step 1",
        "description": "This exercise is a dynamic movement exercise used to prepare the body for activity. As it involves a modification to a traditional bird-dog exercise, it is highly recommended you master your bird-dog technique before attempting the dirty dog."
      },
      {
        "title": "Step 2",
        "description": "Starting Position: Kneel on an exercise mat, positioning your knees and feet hip-width apart, with your feet dorsi-flexed (toes pointing towards your body). Slowly lean forward to place your hands on the mat, positioning them directly under your shoulders at shoulder-width with your hands facing forward."
      },
      {
        "title": "Step 3",
        "description": "Reposition your hands and knees as necessary so that your knees are directly under your hips, and hands are directly under your shoulders. Gently stiffen your abdominal / core muscles to position your spine in a neutral position, avoiding any sagging or arching."
      },
      {
        "title": "Step 4",
        "description": "Rotation Movement: Exhale and gently lift one knee off the floor, and while maintaining the bent-knee position, slowly externally rotate it outwards and upwards. Attempt to move the leg and minimize rotating your trunk."
      },
      {
        "title": "Step 5",
        "description": "Hold this position briefly, while keeping a stable trunk and head level with your spine, then slowly lower your knee back towards the floor. Pause briefly, then repeat."
      },
      { "exerciseTip": null }
    ],
    "bodyPart": "Abs, Butt/Hips",
    "category": ["Abs", "Butt/Hips"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/109-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/109-2.jpg"
    ]
  },
  {
    "title": "Forward Lunge",
    "id": "94bb1903-9cdd-4c46-a11e-b35ed75617c1",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet together. Depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal/core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "In preparation to step forward, slowly lift one foot off the floor, stabilizing your body on the stance (supporting) leg. Avoid any sideways tilting or swaying in your upper body and try not to move the stance (supporting) foot. Hold this position momentarily before stepping forward. The raised (swing) leg should initiate contact with a heel strike first, slowly transferring your body weight into the leading (forward) foot placed firmly on the floor. As you load into this leg, avoid any sideways tilting or swaying in your upper body and try not to move the stance (supporting) foot."
      },
      {
        "title": "Step 3",
        "description": "As you lunge forward, focus more on dropping your hips towards the floor rather than driving your hips forward. This will help control the amount of forward movement of your shinbone (forward tibial translation) over your foot. Continue lowering your body to a comfortable position or until your front thigh becomes parallel with the floor and your tibia (shinbone) is in a slight forward lean. While lunging, simultaneously, bend forward at your hips, maintaining a flat back."
      },
      {
        "title": "Step 4",
        "description": "Firmly push off with your front leg, activating both your quads and glutes (thighs and butt muscles) to return to your upright, starting position."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "We suggest you first learn how to perform single leg-stands on the ground before performing this forward lunge. Once you master the forward lunge, you can progress to doing a lunge using arm drivers and mult-directional glute activation lunges."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/94-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/94-2.jpg"
    ]
  },
  {
    "title": "Forward Lunge with Arm Drivers",
    "id": "9a2f0795-2e6d-4714-b9d0-ca5c3fe7a612",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet together and your arms raised in front to shoulder height, with your elbows fully extended. Depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "In preparation to step forward, slowly lift one foot off the floor, stabilizing your body on the stance (supporting) leg. Avoid any sideways tilting or swaying in your upper body and try not to move the stance (supporting) foot. Hold this position momentarily before stepping forward. The raised (swing) leg should initiate contact with a heel strike first, slowly transferring your body weight into the leading (forward) foot placed firmly on the floor. As you load into this leg, avoid any sideways tilting or swaying in your upper body and try not to move the stance (supporting) foot."
      },
      {
        "title": "Step 3",
        "description": "As you lunge forward, focus more on dropping your hips towards the floor rather than driving your hips forward. This will help control the amount of forward movement of your shinbone (forward tibial translation) over your foot. Continue lowering your body to a comfortable position or until your front thigh becomes parallel with the floor and your tibia (shinbone) is in a slight forward lean. While lunging, simultaneously, bend forward at your hips, maintaining a flat back and drive your extended arms towards the floor in front of you (hands should reach somewhere below your knees). This increases the load on your gluteal muscle group."
      },
      {
        "title": "Step 4",
        "description": "Firmly push off with your front leg, activating both your quads and glutes (thighs and butt muscles) to return to your upright, starting position."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "It is suggested, you first learn how to perform single leg-stands on the ground and forward lunges before progressing to using arm drivers."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/95-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/95-2.jpg"
    ]
  },
  {
    "title": "CKC Parascapular Exercises",
    "id": "c4a64d15-dcee-48cc-b49e-bd3d87062d34",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on an exercise mat or floor, positioning your knees and feet hip-width apart, with your feet dorsi-flexed (toes pointing towards your body). Slowly lean forward to place your hands on the mat, positioning them directly under your shoulders at shoulder-width with your fingers facing forward. Reposition your hands and knees as necessary so that your knees are directly under your hips and hands are directly under your shoulders. Stiffen your abdominal muscles to position your spine in a neutral position, avoid any excessive sagging or arching."
      },
      {
        "title": "Step 2",
        "description": "Slide your right hand forward to a staggered stance position, moving it 6 to 12 inches forward of the shoulder.  Internally rotate both arms turning your finger tips to the center.  Hold this position for 5-10 seconds for a total of 2-4 repetitions.  Repeat switching hand positions."
      },
      { "title": null, "description": "Exercise Variation:" },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Chest, Shoulders",
    "category": ["Chest", "Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/259-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/259-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/259-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/259-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/259-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/259-6.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/259-7.jpg"
    ]
  },
  {
    "title": "Front Plank",
    "id": "b4096dcc-1b88-4913-908e-340a94099f2e",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie prone (on your stomach) on an exercise mat or floor with your elbows close to your sides and directly under your shoulders, palms down and hands facing forward. Contract your quadriceps to extend your legs and dorsiflex your ankles (pull toes towards your shins). Contract your core and abdominal muscles to stiffen your torso."
      },
      {
        "title": "Step 2",
        "description": "Upward Phase. Slowly lift your entire torso off the floor or mat, maintaining a stiff torso and legs. Avoid any arching (sagging) in your low back, hiking (upwards) in your hips or bending in the knees. Avoid shrugging your shoulder and keep your shoulders positioned directly over your elbows with your palms facing down. Continue to breath while holding this position for a specified time (5+ seconds)."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: While maintaining a stiff torso and extended knees, gently lower your body back towards the mat or floor before relaxing."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: While maintaining a stiff torso and extended knees, gently lower your body back towards the mat or floor before relaxing."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "If you experience any pain in the low back with this movement, stop the exercise immediately and consult with your doctor."
      }
    ],
    "bodyPart": "Abs, Back",
    "category": ["Abs", "Back"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/32-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/32-2.jpg"
    ]
  },
  {
    "title": "Glute Bridge Exercise",
    "id": "ba0d6ae6-311d-47d0-9ae9-771501f59fb9",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie supine (on your back) on an exercise mat or the floor in a bent-knee position with your feet flat on the floor. Place your feet hip-width apart with the toes facing away from you. Gently contract your abdominal muscles to flatten your low back into the floor. Attempt to maintain this gentle muscle contraction throughout the exercise"
      },
      {
        "title": "Step 2",
        "description": "Upward Phase: Gently exhale while holding your abdominal contraction and press your hips upwards off the floor into extension by contracting your glutes (butt muscles). At the same time press your heels into the floor for more stability. Avoid pushing your hips too high as this generally increases the amount of hyperextension (arching) in your low back. Maintaining your abdominal contraction helps avoid excessive arching in your low back."
      },
      {
        "title": "Step 3",
        "description": "Lowering Phase: Inhale and slowly lower yourself back towards your starting position."
      },
      {
        "title": "Step 4",
        "description": "Progression: Gradually progress this exercise by starting with both feet together and extending one leg while in the raised position."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Avoid arching your lower back as your press your hips upward which normally occurs if your attempt to push your hips as high as possible. This can be achieved by contracting your abdominal muscles prior to lifting, and keeping them engaged throughout the lift"
      }
    ],
    "bodyPart": "Abs, Butt/Hips",
    "category": ["Abs", "Butt/Hips"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/49-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/49-2.jpg"
    ]
  },
  {
    "title": "Glute Bridge ",
    "id": "26983fa4-d8cc-4a2c-8993-ee76dc1f7526",
    "description": "Lying face up, bend the knees and place the feet on top of a stability ball. Keeping the ball still, press through the heels and raise the hips into the air by squeezing the glute muscles. Rest on the shoulders and the upper back while keeping the body in a straight line from the knees to the head. Slowly lower the hips back down to the ground, keeping the ball still. ",
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "Stability Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/66-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/66-2.jpg"
    ]
  },
  {
    "title": "Hexagon Drill",
    "id": "90e134b3-9532-4c54-8bd9-dd30903ec11c",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Set up six cones in a hexagon, making each segment about 2 feet long.  Each cone should be about 2-3 feet from the center point allowing enough room for you to take a large step.  Stand in the middle of the hexagon in line with a cone.  This will be your starting point.  Stand with your feet hip-width apart, toes pointing forward and arms by your sides. Stiffen your abdominal muscles (“brace”) to stabilize your spine, then depress and retract your scapulae (pull shoulders down and back) without arching your low back. Hold your chest up and out, tilt your head slightly up.  Shift your weight over your heels."
      },
      {
        "title": "Step 2",
        "description": "Ready Position:  Maintaining abdominal bracing, bend the knees and hinge at the hips (shift hips back) bringing the torso forward.  Allow the arms to flex (bend) at the elbow and remain close to your sides.  Shift your weight to the balls of your feet."
      },
      {
        "title": "Step 3",
        "description": "Action:  With the left leg, take a large step forward toward the cone into a lunge while simultaneously driving and extending the right arm forward and down, palms facing in, to the lightly touch the top of the come.  Drive your left elbow backwards.  The left (swing) leg should initiate contact with a heel strike first, slowly transferring your body weight into the leading (forward) foot placed firmly on the floor. As you load into this leg, avoid any sideways tilting or swaying in your upper body and try not to move the stance (supporting) foot. As you lunge forward, focus more on dropping your hips towards the floor rather than driving your hips forward. This will help control the amount of forward movement of your shinbone (forward tibial translation) over your foot.  Immediately push off your left foot and bring it back to center."
      },
      {
        "title": "Step 4",
        "description": "Moving counter clockwise to the next cone (left front rotational), rotate to the left, pivoting off your right foot and lunging with your left leg aligning your feet and hips in the direction you are stepping (toward the cone). Follow the same technique as listed in step 3.  Immediately push off your left foot and bring it back to center."
      },
      {
        "title": "Step 5",
        "description": "Continue counter clock-wise until you reach your starting point.  Repeat the drill lunging forward with your right foot and moving clock-wise."
      },
      {
        "exerciseTip": "It would be beneficial to practice the directional movements with stepping first to make sure your hip and foot alignment is correct before moving to the lunge. You may also have to adjust the size of the hexagon to a distance appropriate for you to perform the exercise correctly. Keep your arm movements strong and controlled."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Full Body/Integrated, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Full Body/Integrated", "Legs - Thighs"],
    "equipment": "Cones",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/207-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/207-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/207-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/207-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/207-5.jpg"
    ]
  },
  {
    "title": "Kneeling Hip-flexor Stretch ",
    "id": "ad702ef3-1503-45e8-a5eb-478cbc3d8338",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: From a kneeling position place the left knee on the floor (or stretch mat) directly under the left hip, and place the right foot in front of the right hip so that the right knee is directly over the right ankle and the right hip is in a position of ninety (90) degrees.  Place both hands gently on the right thigh to help maintain a straight, tall spine."
      },
      {
        "title": "Step 2",
        "description": "Depress and retract your scapulae (pull your shoulders down and back) without arching your low back, \"brace\" (engage your abdominal/core muscles) to stiffen your spine and keep your pelvis level (and stable).  Lean forward into your right hip while keeping your left knee pressed into the ground, do not allow your pelvis to rotate to the anterior (forward).  To increase the stretch to the left hip flexors, squeeze and contract the glute muscles of your left hip."
      },
      {
        "title": "Step 3",
        "description": "Hold the stretch position for 30-45 seconds at a time for a total of 2-5 repetitions; try to move into the stretch a little deeper with each repetition, but be sure to keep your core braced to not allow the pelvis to rotate and lose the stretch.  Complete all repetitions on one side before alternating to the other hip."
      },
      {
        "title": "Step 4",
        "description": "Exercise Variation: To increase the intensity of the stretch raise the left arm straight in the air and tilt slightly to the right side and you lean forward into the right hip; be sure to alternate sides."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Keep the abdominals engaged throughout the entire stretch, this will ensure that the pelvis remains level and will provide the greatest results from the stretch.  To reduce any soreness in the knee on the ground, place an Airex pad or a rolled-up stretch mat under the knee."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/142-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/142-2.jpg"
    ]
  },
  {
    "title": "Lateral Over Unders",
    "id": "20b37dd9-525b-4842-8dba-a977705fc2b6",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position:  Using two stacks of risers; height not exceeding the top of your gastrocnemius (calf) muscle, place a body bar/broomstick across the top, leaving enough room between the stacks for you to step over it laterally.  Make a total of 2-4 stations, lining them up with enough room for you to do a side lunge between them.  Stand directly next to the broomstick, so it is perpendicular to your right leg.  Your feet should be hip- width apart, toes pointing forward or turned slightly outwards, with arms by your sides and elbows flexed (bent) to 90 degrees. Stiffen your abdominal muscles (“brace”) to stabilize your spine, then depress and retract your scapulae (pull shoulders down and back) without arching your low back. Hold your chest up and out, tilt your head slightly up, and shift your weight over your heels"
      },
      {
        "title": "Step 2",
        "description": "Shift your bodyweight into your left leg and lift your right foot off of the ground and bend at the hips, pushing them backwards, while simultaneously shifting your weight to your left leg.  Maintain abdominal “bracing” and alignment. Continue loading your weight into the LEFT leg while lifting the right foot off the ground and bringing your right leg over the broomstick to hip flexion with your knee at a 90 degree angle in alignment with your hips. Your right foot should remain in dorsi-flexion (toes pulled up towards your shin) with the toes pointing forward. Place the right foot down on the opposite side of the broomstick (dowel rod) and shift your weight into your right hip to prepare to bring your left foot over the obstacle to place it next to the right. Level your hips and secure your balance."
      },
      {
        "title": "Step 3",
        "description": "Place your right foot on the ground and bend at the hips, pushing them backwards, while simultaneously shifting your weight to your right leg.  Maintain abdominal “bracing” and alignment. Continue loading your weight into the RIGHT leg while lifting the left foot off the ground and bringing your left leg over the broomstick to hip flexion with your knee at a 90 degree angle in alignment with your hips. Your left foot should remain in dorsi-flexion (the toes pulled up towards the shin) with the toes pointing forward. Level your hips and secure your balance. Place your left foot on the ground, ending in the same body position as you started."
      },
      {
        "title": "Step 4",
        "description": "“Unders” Continue the exercise stepping your right foot to the side, while keeping your weight over your heels and both feet facing forward step your right leg to the side. Once your right foot is firmly placed on the floor, bend at the hips, pushing them backwards while simultaneously shifting your weight towards the right foot. Continue shifting your weight over the right foot until your tibia (shinbone) is vertical to the floor and your right knee is aligned directly over the second toe of your right foot. The goal is to sit deep into the lunge brining the glutes level with the right knee. Your left leg should be at full extension at the knee and your body weight should still be distributed into the right hip. The heels of both feet should stay flat on the floor. Push through your right heel and lift the left leg off the floor bringing it in to starting position."
      },
      {
        "title": "Step 5",
        "description": "Continue into the next over/under until you reach the end.  Facing the same direction, come back down the line leading with your left foot."
      },
      {
        "exerciseTip": "When stepping over the broomstick, be sure not to step too wide to avoid contacting the broomstick with the extended leg.  Contacting the broom stick a can cause it to move resulting in a loss of balance and injury.  A common mistake when performing a body weight side lunge is that individuals often step too wide and are unable to align the tibia (shinbone) over the placed foot and the knee falls inside the foot. In this case, simply shorten the width of the step taken to allow you to align the tibia over the placed foot."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment, Raised Platform/Box",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/206-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-6.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-7.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-8.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-9.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-10.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/206-11.jpg"
    ]
  },
  {
    "title": "Medicine Ball Push-ups",
    "id": "1a4f3be5-92b2-4c95-9c0a-d0e1f5515d3a",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on an exercise mat or floor and bring your feet together behind you. Slowly bend forward to place your palms on the sides of a medicine ball. Carefully shift your weight forward until your shoulders are positioned directly over your hands and the medicine ball. Reposition your feet as needed to allow full extension of your body without any sagging (downwards) or hiking (upwards) at the hips. Stiffen your torso by contracting your core and abdominal muscles (\"bracing\"). Your head should be aligned with your spine."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Slowly lower your body towards the ball while maintaining a rigid torso and head aligned with your spine. Do not allow your low back to sag or your hips to hike upwards during the downward phase. Contract your glutes (butt) and quadriceps (thigh) muscles to help maintain stability. Continue to lower yourself until your chest nears or lightly touches the ball. Your elbows should either remain close to the sides of your body or flare outwards slightly."
      },
      {
        "title": "Step 3",
        "description": "Upward Phase: Press upwards through your arms while maintaining a rigid torso and head aligned with your spine. Do not allow your low back to sag or your hips to hike upwards. Continue pressing until the arms are fully extended at the elbows."
      },
      {
        "title": "Step 4",
        "description": "An alternate ball with handles can be substituted that reduces the pressure on your wrists. When using this type of ball, maintain a neutral wrist position throughout the exercise."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "As the ball adds instability to this exercise, your movements need to be slow and controlled to reduce the chance of injury."
      }
    ],
    "bodyPart": "Abs, Chest, Shoulders",
    "category": ["Abs", "Chest", "Shoulders"],
    "equipment": "Medicine Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/40-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/40-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/40-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/40-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/40-5.jpg"
    ]
  },
  {
    "title": "Mountain Climbers",
    "id": "176dc644-4a14-46f6-94d6-39237c1aa062",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on an exercise mat or floor, positioning your knees and feet hip-width apart, with your feet dorsi-flexed (toes pointing towards your body). Slowly lean forward to place your hands on the floor slightly in front of your shoulders, fingers pointing forwards.  Flex your left hip, bringing your left thigh to your chest, placing your left foot on the floor, heel slighlty lifted and toes pointing forward.  Lift your right knee off the ground, fully extending your right leg behind you, with your foot in dorsi flexion, (toes pointing towards your shins, heel up).  Stiffen your abdominal muscles (“brace”) to stabilize your spine, then depress and retract your scapulae (pull your shoulders down and back)"
      },
      {
        "title": "Step 2",
        "description": "Keeping your hands firmly on the ground, abs engaged and shoulder strong, simultaneously switch leg positions.  Both feet leave the ground as your drive your right knee forward and extend your left leg back.  Now your left leg is fully extending behind you and your right hip is flexed with your right foot on the floor."
      },
      {
        "title": "Step 3",
        "description": "Exercise Variation: If you have limited range of motion in the hips, place hands on a step or platform."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "Keep your weight evenly distributed on both legs. Do not shift all your weight foward into your front foot."
      }
    ],
    "bodyPart": "Butt/Hips, Full Body/Integrated, Legs - Thighs",
    "category": ["Butt/Hips", "Full Body/Integrated", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/258-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/258-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/258-3.jpg"
    ]
  },
  {
    "title": "Overhead Medicine Ball Throws",
    "id": "1f0d5c09-e2b9-4f00-a788-d680c0717c9a",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Make sure that you are working with a partner who can catch the ball, let the partner feel the medicine ball first so they know how much it weighs and can prepare to catch it.  Position your body directly facing your partner with the spine in neutral (normal-to-flat), shoulders depressed (no shrugging) with scapulae retracted (squeezing shoulder blades together). Keep your chest held up and out, head in line with your spine or slightly extended (raised), heels on the floor.  Stand with the feet hip-width apart, the left foot slightly forward, the right foot slightly back while holding a medicine ball between both hands; contract and brace the abdominals while depressing and retracting your shoulder blades.  Your eyes should be looking directly at the target in order to properly aim the throw."
      },
      {
        "title": "Step 2",
        "description": "Keep your feet pressed into the ground, continue to contract and brace your abdominal  muscles, swing your arms upwards to lift the medicine ball overhead and bend your elbows to reach the medicine ball behind your head.  As you lift the ball over your head, shift your weight back into your right leg and lean back to engage the core muscles for extra power for the throw.  While preparing to throw the ball aim the throw by keeping your eyes on your partners hands as you pull the ball back over your head."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "The purpose of this exercise is to generate upper body power, use a ball that is no more than 10% of your bodyweight to ensure that you can acheive the appropriate velocity for the throw."
      }
    ],
    "bodyPart": "Butt/Hips, Full Body/Integrated, Shoulders",
    "category": ["Butt/Hips", "Full Body/Integrated", "Shoulders"],
    "equipment": "Medicine Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/178-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/178-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/178-3.jpg"
    ]
  },
  {
    "title": "Bear Crawl Exercise",
    "id": "2c115823-1bc3-4fc6-9c77-9e7d0123d176",
    "description": "Start in a push-up position with the hands shoulder-width apart and the legs straight out directly behind the body about hip-width apart, keeping the knees bent. Push the toes of the left foot into the floor while squeezing the right thigh and glute. Move the left hand and the right leg forward to start crawling. Alternate the arm and leg movements while keeping the back straight and the hips and shoulders at the same height. Crawl for a desired distance.",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/150-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/150-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/150-3.jpg"
    ]
  },
  {
    "title": "Cycled Split-Squat Jump",
    "id": "4dbff336-0d71-4fe0-87ee-b7c0b29b68dc",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand in an athletic ready position with your feet hip-width apart, your right leg forward, left leg back, with both arms bent at the elbows and the left arm in front of your body and right arm back behind your body.  Prepare for the jump by leaning forward hinging at the hips, while simultaneously keeping your weight back in your thighs, depressing and retracting your scapulae (pull shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "Jumping Movement: Quickly sink your weight back into your hips then explosively push both feet into the floor and driving your hips forward to accelerate your body into the air achieving triple extension (pushing and extending your ankles, knees and hips simultaneously) in both legs. As you jump into the air, keep your feet level with each other and parallel with the floor."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "title": null, "description": "" },
      {
        "exerciseTip": "It is suggested, you first learn how to squat and land before attempting to jump. Once you have mastered the hip-hinge mechanism, begin with small jumps, but emphasize your landing mechanics. Only progress to more explosive jumps once you have mastered your landing mechanics."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Calves and Shins, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Calves and Shins", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/234-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/234-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/234-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/234-4.jpg"
    ]
  },
  {
    "title": "Forward Hurdle Run",
    "id": "b0d82a6a-9bc6-4b8b-99d0-703f67e309b5",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand facing a row of hurdles (the hurdles should be spaced so they have an equal distance between each hurdle); start with the left leg forward and right leg back, right arm forward and left arm back (you can alternate this starting position, but be sure to have the opposite arm and leg forward); lean forward, hinging from the hips to prepare for the run.  Explosively push off with the left leg while rapidly lifting the right knee and swinging the left arm forward to generate the forward movement for the drill."
      },
      {
        "title": "Step 2",
        "description": "Step over the first hurdle and plant the right foot in the space between the first and second hurdles while explosively driving the left knee up to create a ninety degree angle at the left hip, at the same time the left knee is rising up swing the right arm forward moving from the shoulder joint (the movement comes from the shoulder not the elbow)."
      },
      {
        "title": "Step 3",
        "description": "Lift the left foot over the next hurdle and plant it on the ground while explosively lifting the right knee to a height where it creates ninety degrees of hip flexion, at the same time the left arm should swing forward from the shoulder while the right arm swings back into extension.  Continue running over the hurdles by picking up the knees as high as you can to ensure that you are able to clear the hurdles as you run over them."
      },
      {
        "title": "Step 4",
        "description": "Exercise Variation:  Start with one foot touch between each pair of hurdles and progress to being able to do two foot touches in between each pair of hurdles."
      },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Butt/Hips, Legs - Calves and Shins",
    "category": ["Butt/Hips", "Legs - Calves and Shins"],
    "equipment": "Hurdles",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/221-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/221-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/221-3.jpg"
    ]
  },
  {
    "title": "Forward Linear Jumps",
    "id": "150167ad-4c13-48e8-bfa2-6ef0d4c85030",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet hi-width apart, depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Begin your downward phase by first shifting your hips backwards then slowly moving downwards to create a hinge-like movement at your knees. Continue to lower yourself until your feel your heels about to lift off the floor. Try to maintain a flat back by bending forward at the hips. Keep your head facing forward or to the floor, and extend your arms to reach directly behind you while keeping the elbows straight."
      },
      {
        "title": "Step 3",
        "description": "Jumping Movement: With ONLY a very brief pause at the bottom of your downward phase, explode forward and upwards through your lower extremity while throwing your arms overhead to achieve triple extension (pushing and extending your ankles, knees and hips simultaneously). As your jump into the air, try to keep your feet next to each other."
      },
      {
        "title": "Step 4",
        "description": "While in the air traveling forward pull your legs in front of you while keeping your feet next to each other in order to prepare for the landing.  Your head should be level with your eyes looking to the spot on the floor where you want to land."
      },
      {
        "title": "Step 5",
        "description": "Your legs should be in front of you with the feet parallel next to each other, bend the knees and flex the hips to prepare to absorb the impact forces of the landing.  Keep your eyes on the floor to prepare for the landing."
      },
      {
        "exerciseTip": "Your body will follow your eyes so be sure to look to the spot on the floor where you want to land and keep your legs and hips soft, ready to absorb the impact forces upon landing."
      }
    ],
    "bodyPart": "Butt/Hips, Full Body/Integrated, Legs - Calves and Shins, Legs - Thighs",
    "category": [
      "Butt/Hips",
      "Full Body/Integrated",
      "Legs - Calves and Shins",
      "Legs - Thighs"
    ],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/177-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/177-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/177-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/177-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/177-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/177-6.jpg"
    ]
  },
  {
    "title": "Forward Linear Ladder Drill",
    "id": "8b6dbddb-bd07-406b-bb4d-444e73c2cf45",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet hip-width apart at the end of the ladder so it is directly in front of you."
      },
      {
        "title": "Step 2",
        "description": "Push off with your left leg exploding into triple extension (foot is plantar-flexed, knee and hip are extended) while picking up the right leg to step into the next square."
      },
      {
        "title": "Step 3",
        "description": "Push your left leg into triple extension (think about pushing the ground away from you) explosively drive the right knee straight up while maintaining a tall, straight spine; when the right knee is raised, the left arm should be forward in shoulder flexion and the right arm should be back in shoulder extension."
      },
      {
        "title": "Step 4",
        "description": "Plant the right foot in the next square forward, explosively drive the right foot into the ground to create triple extension with the right leg while explosively lifting the left knee up towards the chest; maintain a tall, straight spine while explosively driving the arms into shoulder flexion and extension to help maintain the forward momentum."
      },
      {
        "title": "Step 5",
        "description": "Bring the left foot down and place it in the next square forward and explode into triple extension with the left leg while driving the right knee straight up; continue running forward down the ladder placing one foot in each square and emphasizing explosive leg action to rapidly move into triple extension each time you are pushing off and moving forward; keep your chest lifted, your spine straight and tall and use explosive arm swings to help maintain forward momentum through the course of the ladder."
      },
      {
        "exerciseTip": "Focus on explosive actions with your legs and pick the knees up rapidly--the faster you pick your knees up, the faster and more explosive you can move your leg into triple extension to drive your momentum forward."
      }
    ],
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Ladder",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/175-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/175-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/175-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/175-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/175-5.jpg"
    ]
  },
  {
    "title": "Glute Activation Lunges",
    "id": "26165a8f-bc64-4611-b530-c7d491bbf804",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet together and your arms raised in front to shoulder height, with your elbows fully extended. Depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal/core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "From the same starting position, step out sideways with the right foot (both feet remain pointed forward) to the 3 o'clock position. Once the foot is firmly placed on the floor, begin to bend at the hips, pushing them backwards while simultaneously shifting your weight over that same foot. Continue shifting your weight until your tibia (shinbone) is vertical to the floor and your knee is aligned directly over the second toe of that foot. Your left leg should be near, or at full extension while keeping the right foot flat. The heels of both feet should stay flat on the floor."
      },
      {
        "title": "Step 3",
        "description": "While lunging, simultaneously move your arms and lean your torso in the opposite direction to the lunge movement, increasing the load on your glute muscle group. Firmly push off with your front leg, activating both your quads and glutes (thighs and butt muscles) to return to your upright, starting position."
      },
      {
        "title": "Step 4",
        "description": "From the same starting position, step with one foot in front and across the body (both feet remain pointed forward). Once the foot is firmly placed on the floor, begin to bend at the hips, pushing them backwards while simultaneously shifting your weight over that same foot. Continue shifting your weight until your tibia (shinbone) is vertical to the floor and your knee is aligned directly over the second toe of that foot. Your opposite leg should be flexed with the heel off the ground."
      },
      {
        "title": "Step 5",
        "description": "While lunging, simultaneously rotate your torso and arms in the opposite direction to the lunge movement, increasing the load on your gluteal muscle group. Firmly push off with your front leg, activating both your quads and glutes (thighs and butt muscles) to return to your upright, starting position."
      },
      {
        "exerciseTip": "This series of multi-directional (multi-planar) lunges are intended to activate your glutes which protect your knee during walking, running and jumping-type activities. As many of us have weak glutes, this exercise can be performed as part of your pre-exercise warm-up. Given the moderate degree of complexity of the three movements, we recommend learning this exercise first without your arms and only progress to the arm drivers as you feel comfortable. It is suggested, you first learn how to perform single leg-stands on the ground and forward lunges before performing these glute activation lunges."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/96-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/96-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/96-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/96-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/96-5.jpg"
    ]
  },
  {
    "title": "Hip Rotations (Push-up Position)",
    "id": "6d153673-8ecf-4dbc-9dcb-396b9877e24f",
    "description": [
      {
        "title": "Step 1",
        "description": "This exercise is a dynamic movement exercise used to prepare the body for activity. As it involves a modification to a traditional push-up, it is highly recommended you master your push-up technique before attempting this exercise."
      },
      {
        "title": "Step 2",
        "description": "Starting Position: Kneel on an exercise mat and bring your feet together behind you. Slowly bend forward to place your palms flat on the mat, positioning your hands shoulder-width apart with your fingers facing forward or turned slightly inward. Slowly shift your weight forward until your shoulders are positioned directly over your hands. Reposition your hands as needed to allow full extension of your body without any bend at the hips or knees. Stiffen your torso by contracting your abdominal / core muscles (\"bracing\")and glutes and quadriceps (butt and thigh muscles), and align your head with your spine. Place your feet together with your ankles dorsiflexed (toes pointed towards your shins)."
      },
      {
        "title": "Step 3",
        "description": "Rotational Movement: Exhale and gently draw one knee up towards your chest, bending the knee and flexing at the hip. Do NOT allow your hips and low back to pitch upwards or sag down towards the floor."
      },
      {
        "title": "Step 4",
        "description": "In this knee-tuck position, rotate your hips to move your bent leg across the front of your torso, but avoid rotating or dropping your hips. Continue to move until your hips cannot rotate any further. Your head and shoulder should remain level throughout the exercise. Pause very briefly."
      },
      {
        "title": "Step 5",
        "description": "Rotate in the opposite direction (away from your torso), rotating until your hips cannot rotate any further without movement in your spine. Your head and shoulder should remain level throughout the exercise."
      },
      { "exerciseTip": null }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/110-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/110-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/110-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/110-4.jpg"
    ]
  },
  {
    "title": "Inverted Flyers",
    "id": "c6bc8dba-adee-4ea1-957d-eb9348fd3253",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting position: Stand with feet hip-width apart. In this position, gently contract your abdominal / core muscles (\"bracing\") to stiffen your torso and stabilize your spine. Depress and retract your scapulae (pull your shoulders down and back) without arching your low back while keeping your arms hanging comfortably along your side."
      },
      {
        "title": "Step 2",
        "description": "Keep the right foot planted on the ground, (maintain balance through the movement by pressing the right foot into the ground while extending the leg and squeezing (contracting) both the thigh and glute muscles), lift the left knee so that it is straight in front of the hip and the hip is at a ninety degree angle.  Bend the arms at ninety degree angles, as you raise the left knee, swing the right arm forward to flex the right shoulder while swinging left arm back to create shoulder extension."
      },
      {
        "title": "Step 3",
        "description": "Maintain the abdominal bracing to keep the core stiff and the spine straight, lean forward on the right hip while simultaneously extending the left hip behind your body, at the same time reach forward with the right arm to create right shoulder flexion and move the left elbow back to create left shoulder extension.  Keep the right foot firmly planted into the ground to maintain balance and stability."
      },
      {
        "title": "Step 4",
        "description": "Continue flexing forward on the right hip (continue squeezing the right thigh and glutes to help maintain stability) while reaching forward with the left arm and extending the right leg backwards (into hip extension).  To help maintain balance, find a spot on the floor and fix your gaze on that spot, this will create additional stability."
      },
      {
        "title": "Step 5",
        "description": "At the point where you feel your end range-of-motion while balanced on your right leg, reach forward with the left arm to fully extend the elbow while flexing the shoulder at the same time extend the left leg straight back to create full hip extension.  Point the toes of the left foot towards the wall behind you in order to move into full extension of the left hip (and concurrent flexion of the right hip); continue to maintain abdominal bracing to ensure balance and stability.  Try to keep the hips level and do not let the left hip drop towards the floor or roll away from the right (planted) leg.  Hold this position for 3-5 seconds."
      },
      {
        "exerciseTip": "If balancing on the right leg, use the left leg to help move into a position of flexion on the right hip; pointing the left leg backwards while pointing the toes and straightening the legs will help move the right hip into a position of flexion."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Full Body/Integrated, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Full Body/Integrated", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/144-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/144-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/144-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/144-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/144-5.jpg"
    ]
  },
  {
    "title": "Lunge with Overhead Press",
    "id": "047474de-fe79-4fc5-9f96-2fee85f1cc0f",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet together. Depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal/core muscles) to stiffen your spine. Hold a light-to-moderate weight medicine ball in front of your chest with both hands firmly holding on to the ball."
      },
      {
        "title": "Step 2",
        "description": "Step forward slowly lift the right foot off the floor, stabilizing your body on the left (stance / supporting) leg.  Maintain the abdominal bracing in order to avoid any sideways tilting or swaying in your upper body and press the left (stance / supporting) foot firmly into the ground to reduce any unwanted movement and maintain stability. Hold this position momentarily before stepping forward. The right (swing) leg should initiate contact with a heel strike first, slowly transferring your body weight into the right (forward) leg with the foot placed firmly on the floor, think about lowering yourself into your hips by allowing your weight to shift downwards towards the floor instead of forward. As you load your bodyweight into the right leg, avoid any sideways tilting or swaying in your upper body and try not to move the left (supporting) foot. While simultaneously lowering yourself into your right leg and hip, lift your hands holding the medicine ball straight overhead while continuing to maintain the abdominal bracing."
      },
      {
        "title": "Step 3",
        "description": "While in the bottom (downward) phase of the lunge, pull the medicine ball back down towards your chest, continue to maintain a stiff core and drive your right foot into the ground to extend the right knee and straighten the leg to return to the original (starting) position of standing with both feet under the hips and the ball held in front of the chest.  Repeat for a specific number of repetitions or a certain period of time."
      },
      {
        "title": "Step 4",
        "description": "Exercise Variation: Begin with a light-weight medicine ball in order to learn how to maintain stability all of the way through the movement.  To increase the level of difficulty and to improve core and shoulder strength, once you can perform 8-12 repetitions on each leg, increase the weight of the medicine ball.  Another option is to hold one dumbbell in each hand, start with the elbows bent at ninety degrees and tucked in to the side, at the bottom of the lunge, bend the elbows to bring the weight up to the shoulders and press it directly overhead."
      },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Abs, Butt/Hips, Full Body/Integrated, Legs - Thighs, Shoulders",
    "category": [
      "Abs",
      "Butt/Hips",
      "Full Body/Integrated",
      "Legs - Thighs",
      "Shoulders"
    ],
    "equipment": "Medicine Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/143-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/143-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/143-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/143-4.jpg"
    ]
  },
  {
    "title": "Multidirectional Ladder Drill",
    "id": "8c42fef5-f848-4209-8c74-c46ce2ed499a",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand to the left of the ladder with the feet approximately hip width apart."
      },
      {
        "title": "Step 2",
        "description": "Drop into an athletic ready position with the hips flexed and the straight, tall spine; drive the left foot into the ground while picking up the right foot, (with the left foot on the floor and the right leg in the air the right arm should be back in shoulder extension and the left arm forward in shoulder flexion).  Move the right foot to the right in order to plant it inside the agility ladder to begin the lateral and forward movements for the drill.  The right foot should be planted inside the ladder, once the right foot is planted inside the ladder the left foot is brought in to the ladder and placed next to the right."
      },
      {
        "title": "Step 3",
        "description": "Keep the left foot planted inside the ladder and pick up the right foot to move it to the outside of the ladder, the right foot should be planted to the side and forward of the square where the left foot remains (the movement of the drill requires a zig-zag pattern which requires both lateral and forward movement)."
      },
      {
        "title": "Step 4",
        "description": "Close-up: the left foot is on the outside of the ladder to push-off and the right foot is moved forward and to the right so that it can be placed and planted inside the ladder; when the right foot hits the ground, drop back into an athletic ready position and prepare to pick up the left foot to move it inside the ladder to place it next to the right."
      },
      {
        "title": "Step 5",
        "description": "Close-up: both feet are planted inside the ladder, maintain an athletic ready position with the hips flexed, spine straight and tall and the eyes looking straight ahead (not pictured)."
      },
      {
        "exerciseTip": "Keep your hips flexed with a tall, straight spine to ensure the athletic position throughout the entire range-of-motion of the drill."
      }
    ],
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Ladder",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/172-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/172-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/172-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/172-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/172-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/172-6.jpg"
    ]
  },
  {
    "title": "Bent Knee Push-up",
    "id": "296a32d8-b553-4e24-b7e7-d22d9d05127c",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on an exercise mat or floor and bring your feet together behind you."
      },
      {
        "title": "Step 2",
        "description": "Slowly bend forward to place your palms flat on the mat, positioning your hands shoulder-width apart with your fingers facing forward. Slowly shift your weight forward until your shoulders are positioned directly over your hands. Reposition your hands as needed to allow full extension of your body from the knees without any bend at the hips. Stiffen your torso by contracting your core and abdominal muscles (\"bracing\")."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Slowly lower your body towards the floor while maintaining a rigid torso and head aligned with your spine. Do not allow your low back to sag or your hips to hike upwards during this downward phase. Continue to lower yourself until your chest or chin touch the mat or floor. Your elbows should remain close to the sides of your body or flare outwards slightly."
      },
      {
        "title": "Step 4",
        "description": "Upward Phase: Press upwards through your arms while maintaining a rigid torso and head aligned with your spine. Do not allow your low back to sag or your hips to hike upwards. Continue pressing until the arms are fully extended at the elbows."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Push-ups place stress upon the wrist joints. To alleviate some of this stress you may opt to use dumbbells and grip the handles rather than place your hands on the floor. If your are pressing from an elevation such as a dumbbell, you do not need to lower your chest or chin to the floor, but rather lower yourself until your chest or chin are level with the dumbbell handles."
      }
    ],
    "bodyPart": "Arms, Chest, Shoulders",
    "category": ["Arms", "Chest", "Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/13-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/13-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/13-3.jpg"
    ]
  },
  {
    "title": "Bent-over Row",
    "id": "c6d4d08d-b63e-4bba-8607-8b09d28aed5e",
    "description": "Grip a barbell with palms down so that the wrists, elbows, and shoulders are in a straight line. Lift the bar from the rack, bend forward at the hips, and keep the back straight with a slight bend in the knees. Lower the bar towards the floor until the elbows are completely straight, and keep the back flat as the bar is pulled towards the belly button. Then slowly lower the bar to the starting position and repeat.  ",
    "bodyPart": "Arms, Back, Shoulders",
    "category": ["Arms", "Back", "Shoulders"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/12-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/12-2.jpg"
    ]
  },
  {
    "title": "Bicep Curl",
    "id": "2a34dd0f-ae0c-478a-95f8-c12c4c1c8404",
    "description": "Hold the barbell with both hands facing up so the wrists, elbows, and shoulders are in a straight line about shoulder-width apart. Lift the barbell toward the shoulders while bending the elbows and keeping them next to the middle of the body. Slowly lower the weight to return to the starting position. Keep chest still, using just the arms for the movement.",
    "bodyPart": "Arms",
    "category": ["Arms"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/70-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/70-2.jpg"
    ]
  },
  {
    "title": "Chest Press",
    "id": "4ce1c7e2-7535-43cd-af23-fbb4c618179d",
    "description": "Lie face up on a flat bench, and grip a barbell with the hands slightly wider than shoulder-width. Press the feet into the ground and the hips into the bench while lifting the bar off the rack. Slowly lower the bar to the chest by allowing the elbows to bend out to the side. Stop when the elbows are just below the bench, and press feet into the floor to press the weight straight up to return to the starting position.",
    "bodyPart": "Arms, Chest, Shoulders",
    "category": ["Arms", "Chest", "Shoulders"],
    "equipment": "Barbell, Bench",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/5-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/5-2.jpg"
    ]
  },
  {
    "title": "Chin-ups ",
    "id": "ad189bfa-7eb8-45d2-ba0d-ade800cf37f5",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand under the chin-up bar and reach your arms overhead with your palms facing you.  Reach, jump or lift your body off the floor to grasp the handles firmly with a full grip position (thumbs wrapped around the handles).  Gently cross one leg over the other to stabilize your lower extremity and then stiffen (\"brace\") your abdominal muscles to stabilize your spine.  Align your head vertically with your trunk under your hands and assume a neutral wrist position (i.e., wrist aligned in a straight line with your forearms).  Depress and retract your scapulae (pull shoulders back and down) and attempt to hold this position throughout the exercise."
      },
      {
        "title": "Step 2",
        "description": "Slowly exhale and slowly pull your body upwards by flexing (bending) your elbows and pulling your arms down to your sides  Attempt to pull in a motion that drives your elbows directly down towards the floor, keeping your elbows in front of your body.  Attempt to keep your body aligned vertically to the floor and avoid swinging your body during your upward pull"
      },
      {
        "title": "Step 3",
        "description": "Continue pulling upward until your chin is level with the bar or your hands.  Pause momentarily then slowly return to your starting position by allowing your arms to extend back overhead until your arms are fully extended.  Continue to maintain your shoulder and wrist position, and the vertical alignment of your trunk.  Repeat the movement."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "This exercise targets the back and biceps muscles effectively, but should be performed without compromise to the shoulder. Follow the instructions provided to reduce the stress placed upon your shoulder"
      }
    ],
    "bodyPart": "Arms, Back",
    "category": ["Arms", "Back"],
    "equipment": "Pull up bar",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/190-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/190-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/190-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/190-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/190-5.jpg"
    ]
  },
  {
    "title": "Close-grip Bench Press",
    "id": "5fecd2e9-1de6-46c3-9640-6f5799e96b01",
    "description": "Lie face up on a barbell bench, then reach up and grip the bar with the hands directly in line with the shoulders and the elbows pointed towards the feet. Unrack the bar and bring it towards the chest by bending the elbows and keeping them close to the ribs. Push the feet into the floor, and press the hips into the bench as the bar is pushed away from the chest to return to the starting position.",
    "bodyPart": "Arms, Chest",
    "category": ["Arms", "Chest"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/311-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/311-2.jpg"
    ]
  },
  {
    "title": "Downward-facing Dog",
    "id": "1453f5a5-3a97-4ecc-aaef-f47062d67c1a",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on an exercise mat or floor and bring your feet together behind you. Slowly bend forward to place your palms flat on the mat, positioning your hands shoulder-width apart with your fingers facing forward. Slowly lift yourself into a push-up position, shifting your hands until your shoulders are positioned directly over your hands. Reposition your feet as needed to allow full extension of your body. Stiffen your torso by contracting your core and abdominal muscles to prevent any arching in your low back or hiking of your hips towards the ceiling."
      },
      {
        "title": "Step 2",
        "description": "Upward Phase: While maintaining a rigid torso and full extension in your arms and legs, slowly exhale and shift your weight backwards by pushing your hips backwards and upwards. Maintain your head alignment with your spine, but slowly move your head between your shoulders as your body moves backwards and attempt to push your heels towards the floor. Maintain the stiffness in your torso to prevent the tendency of your back to arch. Continue moving until your body forms an inverted-V, keeping both arms and legs extended and a neutral (flat) spine. Allow a slight bend in the knees if required to achieve the inverted-V position."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Inhale and return your body to the starting push-up position, maintaining the alignment of all your body segments."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Inhale and return your body to the starting push-up position, maintaining the alignment of all your body segments."
      },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Arms, Back, Butt/Hips, Full Body/Integrated, Legs - Calves and Shins, Legs - Thighs",
    "category": [
      "Arms",
      "Back",
      "Butt/Hips",
      "Full Body/Integrated",
      "Legs - Calves and Shins",
      "Legs - Thighs"
    ],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/18-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/18-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/18-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/18-4.jpg"
    ]
  },
  {
    "title": "Hammer Curl",
    "id": "e99fc82e-932e-485d-b2bb-0e7aadbcf9e3",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand holding dumbbells in your hands with a closed, neutral grip (thumbs around the handles with your palms facing your body). Position the dumbbells alongside your thighs with your elbows fully extended. Assume a split-stance position to stabilize your body, stiffen your torso by contracting your abdominal/core muscles (\"bracing\"), and depress and retract your scapulae (pull your shoulders down and back), maintaining these positions throughout the exercise. Your head and neck should be aligned with your spine."
      },
      {
        "title": "Step 2",
        "description": "Upward Phase: Exhale and slowly flex (bend) one or both elbows in unison until the dumbbell(s) near(s) the front of your shoulder. It performing alternating arm curls, the opposite arm should remain in the starting position. Perform the curl while keeping your torso erect (no arching your low back) or without moving your elbows forward. Maintain a neutral wrist position (wrist straight without any bend with your palms facing your body) and avoid shrugging your shoulders throughout the movement."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Inhale and gently lower the dumbbells back towards your starting position until the elbow(s) is/are fully extended, keeping the dumbbell in the neutral position. Maintain your split-stance, torso and shoulder position and if performing alternating arm curls, repeat to the opposite side."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "As some of us show structural differences at the elbow, we may not be able to hold the dumbbells against our sides in the lowered position unless we force a bend at our wrists. The dumbbell position selected should be one that is most comfortable for you and keeps the wrists aligned straight with the forearm."
      }
    ],
    "bodyPart": "Arms",
    "category": ["Arms"],
    "equipment": "Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/10-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/10-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/10-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/10-4.jpg"
    ]
  },
  {
    "title": "Inchworms",
    "id": "2af2852d-ca7e-4c7f-bb91-694d87eda774",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position:  From a standing position with your feet together or slightly apart, stiffen (“brace”) your abdominal muscles to stabilize your spine."
      },
      {
        "title": "Step 2",
        "description": "Gently exhale and bend forward from your hips (\"hip hinging\"), keeping your knees extended (but not locked), and extend your arms in front of your body while slowly lowering your torso towards the floor until you can place your fingers or palms of your hands on the floor in front of your body.  Maintaining a flat spine and a soft bend in your knees during this movement is acceptable."
      },
      {
        "title": "Step 3",
        "description": "Slowly begin to walk your hands forward (6-12” or 12 ½ - 25 cm steps) without moving your feet (your heels will begin to rise off the floor).  Continue walking yourself forward until you reach a full-push-up position where your spine, hips and head are level with the floor (plank position)."
      },
      {
        "title": "Step 4",
        "description": "Perform one full push-up, lowering your chest and hips simultaneously to the floor while maintaining a rigid torso and head aligned with your spine.  Do not allow your low back to sag or your hips to hike upwards during this downward phase.  Continue to lower yourself until your chest or chin touch the floor. Allow your elbows to flare outwards during the lowering phase."
      },
      {
        "title": "Step 5",
        "description": "Press upwards through your arms while maintaining a rigid torso and head aligned with your spine.  Do not allow your low back to sag or your hips to hike upwards. Continue pressing until the arms fully extend at the elbows.  Slowly begin walking your feet forward towards your hands, taking 6-12” steps without moving your hands.  Maintain a flat spine throughout and continue walking until your feet are close to your hands."
      },
      {
        "exerciseTip": "To maximize the benefits of this exercise and reduce the potential for injury, it is important to monitor the position of your spine throughout the exercise.  Focus on keeping your spine flat and avoid any rounding of your low back.  Smaller steps help maintain correct body position.  Reaching too far forward with your arms will put unnecessary stress on the shoulders."
      }
    ],
    "bodyPart": "Abs, Arms, Back, Chest, Full Body/Integrated, Shoulders",
    "category": [
      "Abs",
      "Arms",
      "Back",
      "Chest",
      "Full Body/Integrated",
      "Shoulders"
    ],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/254-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/254-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/254-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/254-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/254-5.jpg"
    ]
  },
  {
    "title": "Lying Barbell Triceps Extensions ",
    "id": "00e62c20-df2c-40ff-8436-3733be345567",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Holding a barbell with a closed, pronated grip (palms facing your feet and thumbs wrapped around the bar), lie supine (on your back) on a flat bench with your feet firmly placed on the floor. Slowly press the barbell off your chest, fully extending your elbows until the barbell is positioned directly above your face with your palms still facing towards your feet. Maintain a neutral wrist position (no flexion or extension at the wrist)."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Inhale and slowly bend the elbows, lowering the bar in a controlled manner towards your forehead or slightly behind your head while maintaining your neutral wrist position. Your upper arms should remain vertical to the floor as the elbows bend. Lower the bar until it sits just above your forehead or until you notice the upper arms begin to drift backwards."
      },
      {
        "title": "Step 3",
        "description": "Upward Phase: Exhale and slowly return to your starting position with your elbows fully extended."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "Attempt to keep your upper arms vertical to the floor throughout the exercise and keep your elbows shoulder-width apart."
      }
    ],
    "bodyPart": "Arms",
    "category": ["Arms"],
    "equipment": "Barbell, Bench",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/36-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/36-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/36-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/36-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/36-5.jpg"
    ]
  },
  {
    "title": "Overhead Triceps Stretch",
    "id": "15ac3904-adbc-4fd9-a376-a84a44901cf3",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position:  Stand with feet hip-width apart and roll your shoulders down and back (depress and retract the scapulae).  Reach your right arm to the ceiling keeping your shoulder down (away from your ears).  Bending at the elbow, let your right hand drop to the middle of your back, palm facing your back.  Reach your left hand to the ceiling and place your fingers on your right arm, just above the elbow, applying light pressure to deepen the stretch."
      },
      {
        "title": "Step 2",
        "description": "Hold the stretch position for 15-30 seconds for 2-4 repetitions; try to stretch a little deeper each repetition."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Arms",
    "category": ["Arms"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/174-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/174-2.jpg"
    ]
  },
  {
    "title": "Lateral Hurdle Run",
    "id": "1e8617b7-4e37-4037-85b5-8af4db150ad1",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand to the side of the hurdles so that they are lying to your left, your feet should be hip-width apart with the knees slightly bent.  Bend your hips and drop into an athletic ready position so that your knees are slightly bent and your chest is directly over your toes.  Your arms should be bent with the elbows fixed at approximately ninety degrees (during the drill ensure that the swinging is coming from the shoulder joint and not from the elbows).  Shift your bodyweight so that your weight is in your right leg.  Pick the left foot up so the left hip is at ninety degrees and prepare to place the left foot on the ground beween the first two hurdles while pushing the right foot in to the ground to move your body to your left.  Maintain an abdominal contraction and straight spine during this drill and keep your feet parallel so your toes are pointed straight ahead (in the same direction that you are facing)."
      },
      {
        "title": "Step 2",
        "description": "When your left foot hits the ground, shift your bodyweight into your left leg, pick up the right foot to the point where the right hip is approximately ninety degrees, lift the foot over the hurdle and bring it to the ground next to the left foot."
      },
      {
        "title": "Step 3",
        "description": "Explosively push your right foot into the ground and pick up the left foot until the point where the left hip achieves approximately ninety degrees of flexion and continue running over the hurdles allowing both feet to touch the space in between each individual hurdle."
      },
      {
        "title": "Step 4",
        "description": "Exercise Variation: Once you have run over the hurdles moving to your right, change directions and run over the hurdles moving to your left.  Once you establish the rythym and pace of the movement, keep your head and eyes raised so that you are looking straight ahead where your opponent would be during an athletic competition."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Make sure to land softly as you step between the hurdles, land on the ball of the foot and roll down to the heel and keep your weight back in your hips and you run through the drill."
      }
    ],
    "bodyPart": "Full Body/Integrated, Legs - Calves and Shins, Legs - Thighs",
    "category": [
      "Full Body/Integrated",
      "Legs - Calves and Shins",
      "Legs - Thighs"
    ],
    "equipment": "Hurdles",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/226-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/226-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/226-3.jpg"
    ]
  },
  {
    "title": "Partner Standing Row with Resistance Tubing ",
    "id": "739dcda2-8ae2-4a2f-850b-b0e3608862ac",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: You and a training partner should have specialized resistance x-pattern resistance tubing with four handles so that two people can use it at the same time; or take 2 pieces of standard resistance tubing with handles and cross them to interlink them and create a 4-handled pattern.  You and your training partner should stand facing each other with your feet hip-width apart and the right foot slightly in front of the left to create additional stability; your knees and hips should be slightly bent so that you each can sink into your hips and contract your abdominals (bracing) for additional stability.  You and your partner should each position your body with the spine in neutral (normal-to-flat), shoulders depressed (no shrugging) with scapulae retracted (squeezing shoulder blades together).  You and your partner should each keep your chest held up and out, with your head in line with your spine or slightly extended (raised).  Grab the handles firmly in both hands and hold them so that your palms are facing the ground and pull back slightly to create opposing lines of pull."
      },
      {
        "title": "Step 2",
        "description": "You and your partner should each maintain an abdominal contraction with your feet planted on the floor to create stability through the hips and core.  At the same time you and your partner should each pull back on the handles, the pulling motion should be initiated from the shoulder blades (which are rectraced), continue holding on to the handles but think about pulling from the elbows to engage the upper back and shoulder muscles."
      },
      {
        "title": "Step 3",
        "description": "Once you and your partner have pulled the handles back (into shoulder extension) you each should hold your shoulder blades retracted in an isometric contraction.  With both arms held in an isometric contraction you and your partner should each allow your right arm to come forward in shoulder flexion (arm moving forward towards your training partner) while maintaining the left arm in a position of shoulder extension."
      },
      {
        "title": "Step 4",
        "description": "Once you and your partner have each allowed your right arm to move forward and pulled it back, you each should keep the right elbow next to the body with the right shoulder held in an isometric contraction (allowing no movement) while you each reach the left arm forward (the shoulder moves into flexion).  Continue the abdominal bracing and alternate the arm movements, you and your partner should work together to provide resistance to one another while simultaneously pulling back on the bands to keep the tension."
      },
      {
        "title": "Step 5",
        "description": "Exercise Variation: Start with slow, steady consistent movements to become used to providing manual resistane through the tension of the rubber tubing; to increase the intensity you can either stand further away from each other to create additional tension on the rubber or increase the speed of the movement to make it more of a power-based exercise."
      },
      {
        "exerciseTip": "Remember to keep your feet planted into the floor with your abdominals engaged and contracted (braced) to ensure spinal stability."
      }
    ],
    "bodyPart": "Arms, Back, Butt/Hips",
    "category": ["Arms", "Back", "Butt/Hips"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/267-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/267-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/267-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/267-4.jpg"
    ]
  },
  {
    "title": "Reverse Bicep Curl",
    "id": "bf2af76d-421a-4517-ac0a-10fb61c571db",
    "description": "Hold the barbell about shoulder-width apart with the palms facing down and hands in a straight line with shoulders and elbows. Lift the bar towards the shoulders while bending at the elbows and keeping them down close to the sides of the body. Slowly lower the weight to return to the starting position.",
    "bodyPart": "Arms",
    "category": ["Arms"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/310-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/310-2.jpg"
    ]
  },
  {
    "title": "Reverse Slam",
    "id": "1f16c252-1175-4e0c-bc2e-35dc35417cec",
    "description": "Stand with the ball in both hands in front of the body. Jump up on the toes and raise the ball overhead, then quickly bend the elbows to slam the ball down behind the body. Turn around and pick up the ball, and repeat. ",
    "bodyPart": "Butt/Hips, Full Body/Integrated, Legs - Thighs, Shoulders",
    "category": [
      "Butt/Hips",
      "Full Body/Integrated",
      "Legs - Thighs",
      "Shoulders"
    ],
    "equipment": "Medicine Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/218-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/218-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/218-3.jpg"
    ]
  },
  {
    "title": "Rotational Uppercut",
    "id": "23d07683-42a5-4e23-b3dc-dea62e999fc0",
    "description": "Stand with the feet hip-width apart, hold one dumbbell in each hand with the palms facing up, and the elbows close to the rib cage. Sink back into the hips and press the left foot into the ground to turn to the right, keep the left elbow bent and perform an uppercut with the left arm, bringing the left elbow to shoulder-height. Slowly lower the left arm and turn back to the center. Push the right foot into the ground to turn the left hip while swinging the right arm up in an uppercut.",
    "bodyPart": "Arms, Full Body/Integrated, Shoulders",
    "category": ["Arms", "Full Body/Integrated", "Shoulders"],
    "equipment": "Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/369-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/369-2.jpg"
    ]
  },
  {
    "title": "Kneeling Lat Stretch (w/bench)",
    "id": "e0d0af39-6d07-4183-bc8d-ab4ed66274b5",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on an exercise mat or floor positioning your knees and feet hip-width apart, with your feet plantar-flexed (toes pointing away from your body).  Stiffen your core and abdominal muscles (\"bracing\") to stabilize your spine and pelvis."
      },
      {
        "title": "Step 2",
        "description": "Slowly lean forward while bending from the hips and maintaining the abdominal bracing to keep the spine straight, place your hands on the bench while keeping the arms straight with the elbows extended and position the arms so there is a straight line from the shoulders, through the elbows to the wrists."
      },
      {
        "title": "Step 3",
        "description": "With your hands on the bench, keep your knees directly under your hips while leaning back into your hips to increase the stretch into the upper back.  Maintain the stiff core with the abdominal bracing to keep the spine straight and the pelvis level.  Keep your chin tucked into your neck to stabilize your cervical spine and to keep your head from dropping towards the floor."
      },
      {
        "title": "Step 4",
        "description": "Hold the stretch position for approximately 30-45 seconds, to increase the stretch into the latissimus dorsi (back) muscles, slowly rotate your thumbs to point up towards the ceiling.  Repeat 2-4 times."
      },
      {
        "title": "Step 5",
        "description": "Exercise Variation: To increase the stretch, supinate the palms (turn the palms up to face the ceiling) while leaning back into your hips."
      },
      {
        "exerciseTip": "Exhale as you lean back into your hips, and do not let your head drop towards the ground."
      }
    ],
    "bodyPart": "Back",
    "category": ["Back"],
    "equipment": "Bench",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/141-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/141-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/141-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/141-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/141-5.jpg"
    ]
  },
  {
    "title": "Medicine Ball Lunge to Chest Pass",
    "id": "1447e4b6-ae86-4116-a265-e068bb510bc5",
    "description": [
      {
        "title": "Step 1",
        "description": "Before you begin make sure that you are working with a partner who can catch the ball, (let the partner feel the medicine ball first so he or she knows how much it weighs and can prepare to catch it) or be sure that you have a solid wall or medicine ball rebounder that can withstand the forces of impact from a medicine ball."
      },
      { "title": null, "description": "" },
      {
        "title": "Step 2",
        "description": "The partner preparing to catch the medicine ball should stand with his or her feet firmly planted into the ground, the hips slightly flexed, the abdominals engaged and both hands held straight in front of the chest in order to provide a target for the partner throwing the ball.  The person throwing the ball should step forward with the right foot into a forward lunge, as the right foot hits the ground bend your left knee to allow you to sink into your right hip simultaneously push the medicine ball away from your chest to throw it directly to your partner."
      },
      {
        "title": "Step 3",
        "description": "The partner catching the ball should catch it in a standing position with the arms outstretched straight out in front of his or her body, as the medicine ball hits the hands, allow it to decelerate towards the chest.  Once the catching partner catches the medicine ball he or she should then step forward with the left leg into a forward lunge to throw the ball back to the partner who originated the throw who should be standing with the hips flexed, both feet hip width apart and the arms outstretched straight in front of his or her body to prepare to catch the ball."
      },
      {
        "title": "Step 4",
        "description": "The partner who originated the throwing should again step forward with his or her right leg into a forward lunge and throw the medicine ball back to the other person who is standing with outstretched hands prepared to catch the ball and step back into a forward lunge."
      },
      {
        "exerciseTip": "During the entire thowing and catching sequence each partner should position his or her body with the spine in neutral (normal-to-flat), shoulders depressed (no shrugging) with scapulae retracted (squeezing shoulder blades together). Each partner should keep his or her chest held up and out, the head in line with his or her spine and both hands out front while preparing to catch the ball (holding the hands in front of the body gives the partner throwing the ball a target to aim for when releasing the ball; the throwing partner should keep his or her eyes on the catching partner's hands to ensure good aim)."
      }
    ],
    "bodyPart": "Abs, Back, Butt/Hips, Chest, Full Body/Integrated, Shoulders",
    "category": [
      "Abs",
      "Back",
      "Butt/Hips",
      "Chest",
      "Full Body/Integrated",
      "Shoulders"
    ],
    "equipment": "Medicine Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/264-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/264-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/264-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/264-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/264-5.jpg"
    ]
  },
  {
    "title": "Partner Assisted Bodyweight Squats",
    "id": "04f1158f-b7da-4eed-be3d-886d6d8bb27e",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Two training partners should stand approximately arm's length away from one another with their feet slightly wider than hip width apart with your toes pointed forward or slightly outward.  Position your feet so that the balls of your feet align under your center of gravity. Each partner should outstretch his or her arms so they can grasp each other's forearms with their hands."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Each partner should start the downward phase by first shifting your hips backwards then downwards to create a hinge-like movement at your knees. As you lower your hips the knees will then start to shift forward slowly, but try to control the amount of forward translation (movement) of the tibia (shinbone). Brace your core to keep your trunk stable and spine straight.  Each partner should maintain a firm grip and allow each other to lean back slightly in order to be able to sink deeper into the hips for a greater range-of-motion."
      },
      {
        "title": null,
        "description": "Lowered Position: From the front, the knees should continue to remain aligned over the second toe, and body weight should be evenly distributed over both feet. From the side, the position of the tibia (shinbone) and torso should be parallel with each other and the low back should appear flat or showing the beginning of some rounding."
      },
      {
        "title": "Step 4",
        "description": "Upward Phase: While keeping a firm grip on one another's forearms, each person should maintain a straight trunk with a head-up position, and exhale while extending the hips and knees by pushing their feet into the floor through the heels. The hips and torso need to rise together while keeping the heels flat on the floor and knees aligned over the second toe. Each person should continue extending his or her hips until returning to the starting position."
      },
      {
        "title": "Step 5",
        "description": "Exercise Variation: Each partner can place his or her feet in a split-squat position with the feet hip width apart and one foot slightly in front of the other.  Each partner can balance on a single leg and perform a single leg squat, the act of the partners holding on to one another during the squatting movement will help to maintain the balance on one leg."
      },
      {
        "exerciseTip": "Technique is very important in this lift. The tendency is to hold the tibia (shinbone) too vertical which forces you to lean your torso too far forward. Using a mirror for feedback, shift your tibia (shinbone) forward while keeping your heels on the floor, then bring your torso upright back (moving it more upright), but do so from the hips and not through the low back. Squeeze your abdominals to help prevent the excess arching in the back with this correction. If using a squat rack, the safety rungs on the rack should be positioned at mid-thigh level."
      }
    ],
    "bodyPart": "Abs, Butt/Hips, Legs - Thighs",
    "category": ["Abs", "Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/265-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/265-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/265-3.jpg"
    ]
  },
  {
    "title": "Supine Hip Flexor Stretch",
    "id": "aad8aeea-6843-4c4c-8b24-7fe6d386f028",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie supine (on your back) on an exercise mat or firm surface, extending your legs so there are lying flat along the floor with the toes pointing up towards the ceiling. Slide your left foot back towards your hip so that your foot is flat along the floor and the knee is pointing up towards the ceiling, keep the right leg flat along the ground."
      },
      {
        "title": "Step 2",
        "description": "Depress and retract your scapulae (pull your shoulder down and back) without increasing the arch in your low back or lifting your hips off the mat / floor. Hold this position throughout the exercise. Reach down with both hands and gently grab the back of the left thigh to pull your knee back towards your chest, at the same time keep your right leg lying flat along the ground and push the back of the heel into the ground while contracting (squeezing) your right glute (butt) muscle."
      },
      {
        "title": "Step 3",
        "description": "To increase the stretch, maintain the abdominal contraction, exhale and slowly pull the knee further back towards the chest while straightening the leg and pushing your heel away from your body.  Hold position for 30-45 seconds, straighten the leg and repeat for 2-5 repetitions; alternate legs and repeat."
      },
      {
        "title": "Step 3",
        "description": "To increase the stretch, maintain the abdominal contraction, exhale and slowly pull the knee further back towards the chest while straightening the leg and pushing your heel away from your body.  Hold position for 30-45 seconds, straighten the leg and repeat for 2-5 repetitions; alternate legs and repeat."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Continue breathing through the exercise, use the exhale phase to slowly pull the knee towards the chest to increase the stretch."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/146-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/146-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/146-3.jpg"
    ]
  },
  {
    "title": "Thomas Stretch",
    "id": "f9c80132-240f-4c58-88c6-78acd52ae434",
    "description": [
      {
        "title": "Step 1",
        "description": "Sit at the end of a massage table with your mid thigh aligned with the edge. Sit tall, lifting your head towards the ceiling.  Stiffen your abdominal muscles to engage (“brace”) your spine, then depress and retract your scapulae (pull your shoulders down and back) without arching your low back."
      },
      {
        "title": "Step 2",
        "description": "Keeping your abdominals engaged, lean slightly backwards drawing your left knee off the table towards the chest and folding your hands under your left thigh with out moving your torso.  Continue leaning back, keeping your head in line with your spine, and abdominals engaged.  Draw your right knee up towards the ceiling, lifting your right thigh off the table."
      },
      {
        "title": "Step 3",
        "description": "Begin to round out your back, lowering it to the table one vertebra at a time.  Keeping hold of your left thigh, allow your right knee to stay pointed toward the ceiling.  As your lower your head coming into a supine (on your back) position, keep a hold of your left leg and lower your right thigh straight down to the table maintaining the bent knee position to allow your  lower leg to hang off the table and a stretch through the right hip flexor."
      },
      {
        "title": "Step 4",
        "description": "Hold the stretch position for 15-30 seconds at a time for a total of 2-4 repetitions.  Complete  all repetitions on one side before alternating to the other leg."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Transition from starting position to the ending supine position with control to receive the full beneft if the stretch."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/192-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/192-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/192-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/192-4.jpg"
    ]
  },
  {
    "title": "Wrist Curl - Flexion",
    "id": "dc84eac0-f032-4bb6-86ad-543e40286426",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Holding two dumbbells, kneel and rest your elbows on a bench with approximately a 90 degree bend at the elbows and the dumbbells hanging freely off the edge of the pad. Supinate your forearms (rotate the forearms so that the tops are along the bench and the palms are facing upward) keep your wrists in a neutral position (not in flexion or extension)."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Inhale and slowly allow the wrists to move into extension (allow dumbbells to move towards the floor) without releasing your grip, extending your arms or leaning forward / backward. Hold this end position briefly."
      },
      {
        "title": "Step 3",
        "description": "Upward Phase: Exhale and slowly contract your forearm flexor muscles (along the top of the forearm) rolling your wrists towards you in order to return the dumbbells back to the starting position."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Arms",
    "category": ["Arms"],
    "equipment": "Bench, Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/30-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/30-2.jpg"
    ]
  },
  {
    "title": "Wrist Curl - Extension",
    "id": "620345ec-4ec2-4899-bda0-c4a0fa973b0b",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Holding two dumbbells, kneel and rest your elbows on a bench with approximately a 90 degree bend at the elbows and the dumbbells hanging freely off the edge of the pad. Pronate your forearms (rotate forearms to face palms downward and the bottom of the forearms are resting on the bench) while keeping your wrists in a neutral position (not in flexion or extension)."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Inhale and slowly allow the wrists to move into flexion (allow dumbbells to move towards the floor) without releasing your grip, extending your arms or leaning forward / backward. Hold this end position briefly."
      },
      {
        "title": "Step 3",
        "description": "Upward Phase: Exhale and slowly contract your forearm extensor muscles (along the top of the forearm) and roll your wrists to pull the weight up and return the dumbbells back to the starting position."
      },
      {
        "title": "Step 3",
        "description": "Upward Phase: Exhale and slowly contract your forearm extensor muscles (along the top of the forearm) and roll your wrists to pull the weight up and return the dumbbells back to the starting position."
      },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Arms",
    "category": ["Arms"],
    "equipment": "Bench, Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/29-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/29-2.jpg"
    ]
  },
  {
    "title": "90 Lat Stretch",
    "id": "a78d729f-d045-4172-9ab7-e3432cbf81dc",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position:  Stand with your feet hip-width apart with arms by your sides. Stiffen your abdominal muscles (“brace”) to stabilize your spine, then depress and retract your scapulae (pull shoulders down and back) without arching your low back. Hold your chest up and out, tilt your head slightly up."
      },
      {
        "title": "Step 2",
        "description": "With a slight bend in the knee, shift your weight over your heels and slowly begin bending forward at the hips, maintaining the abdominal bracing and flat back.  Place your hands on the table while keeping the arms straight with the elbows extended and position the arms so there is a straight line from the shoulders, through the elbows to the wrists."
      },
      {
        "title": "Step 3",
        "description": "With your hands on the table, keep your legs directly under your hips while leaning back into your hips, straightening the legs and drawing your torso closer to the ground while keeping a flat back.  Keep your chin tucked into your neck to stabilize your cervical spine and to keep your head from dropping towards the floor."
      },
      {
        "title": "Step 4",
        "description": "Hold the stretch position for 15-30 seconds for a total of 2-4 repetitions. To increase the stretch of the latissimus dorsi (back) muscles, rotate your thumbs to point toward the ceiling."
      },
      {
        "title": "Step 5",
        "description": "Exercise Variation:  To increase the stretch, supinate the palms (turn the palms up to face the ceiling) while leaning back into your hips."
      },
      {
        "exerciseTip": "Exhale as you lean back into your hips.  Be sure not to fully “lock” the knees while holding this position."
      }
    ],
    "bodyPart": "Back",
    "category": ["Back"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/198-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/198-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/198-3.jpg"
    ]
  },
  {
    "title": "Cat-Cow",
    "id": "fdd18f88-6cae-4688-babf-b7f37abbe25c",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on an exercise mat or floor, positioning your knees and feet hip-width apart, with your feet dorsi-flexed (toes pointing towards your body)."
      },
      {
        "title": "Step 2",
        "description": "Slowly lean forward to place your hands on the mat, positioning them directly under your shoulders at shoulder-width with your hands facing forward. Reposition your hands and knees as necessary so that your knees are directly under your hips and hands are directly under your shoulders."
      },
      {
        "title": "Step 3",
        "description": "Gently stiffen your core and abdominal muscles to position your spine in a neutral position, avoiding any sagging or arching."
      },
      {
        "title": "Step 4",
        "description": "Upward (Cat) Phase: Gently exhale and contract your abdominal muscles, pushing your spine upwards towards the ceiling and hold this position for 10 - 15 seconds. Allow your head to fall towards your chest, maintaining alignment with the spine."
      },
      {
        "title": "Step 5",
        "description": "Downward (Cow) Phase: Slowly relax and yield to the effects of gravity. Let your stomach fall towards the floor (increasing the arch in your low back) and allow your shoulder blades to fall together (move towards the spine). Hold this position for 10 - 15 seconds before returning to your starting position"
      },
      { "exerciseTip": null }
    ],
    "bodyPart": "Back, Chest",
    "category": ["Back", "Chest"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/15-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/15-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/15-3.jpg"
    ]
  },
  {
    "title": "Contralateral Limb Raises",
    "id": "0728e5dd-e704-4086-bae3-cf8da06a4503",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie prone (on your stomach) on a mat with your legs extended, ankles slightly plantarflexed (toes pointing away from your shins), arms extended overhead with palms facing each other. Relax your head to align it with your spine."
      },
      {
        "title": "Step 2",
        "description": "Upward Phase: Exhale, contract your abdominal/core muscles to stabilize your spine and slowly raise one arm a few inches off the floor keeping your arm extended and avoiding any rotation in your arm. Maintain your head and torso position, avoiding any arching in your back or raising of your head. Hold this position briefly."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Gently inhale and lower your arm back towards your starting position without any movement in your low back or hips."
      },
      {
        "title": "Step 4",
        "description": "Exercise Variation (1): From your starting position, contract your abdominal and core muscles to stabilize your spine and slowly extend one hip (raise one leg) a few inches off the floor keeping your leg extended, ankle plantarflexed (toes pointing away from your shins) and avoiding any rotation in your leg. Maintain your head and torso position, avoiding any arching in your back or raising of your head. Hold this position briefly before returning to your starting position."
      },
      {
        "title": "Step 5",
        "description": "Exercise Variation(2): From your starting position, contract your abdominal/core muscles to stabilize your spine and slowly extend one hip (raise one leg) a few inches off the floor while simultaneously raising the opposite arm a few inches off the floor. Keep both your leg and arm extended and avoiding any rotation in each. Maintain your head and torso position, avoiding any arching in your back or raising of your head. Hold this position briefly before returning to your starting position."
      },
      { "exerciseTip": null }
    ],
    "bodyPart": "Back, Butt/Hips, Shoulders",
    "category": ["Back", "Butt/Hips", "Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/53-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/53-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/53-3.jpg"
    ]
  },
  {
    "title": "Front Squat",
    "id": "adc5ffba-95b0-4f4d-a24b-24886dc9267d",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet slightly wider than hip-width, facing outward or turned slightly outwards while holding a dumbbell in each hand by your sides, with palms facing inwards. Depress and retract your scapulae (pull shoulders down and back)."
      },
      {
        "title": "Step 2",
        "description": "Stiffen your core and abdominal muscles (“bracing”) to stabilize your spine. Curl the dumbbells to a starting position where they rest on the front edge of your shoulders or just in front of your shoulders. Hold your chest up and out, tilt your head slightly up, and shift your weight over your heels."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Start the downward phase by first shifting your hips backwards then downwards to create a hinge-like movement at your knees. As you lower your hips the knees will then start to shift forward slowly, but try to control the amount of forward translation (movement) of the tibia (shinbone). Attempt to keep your back flat."
      },
      {
        "title": "Step 4",
        "description": "Continue to lower yourself until your thighs are parallel or almost parallel with the floor, or until your heels begin to lift off the floor, or until your torso begins to round or flex forward. Monitor your feet, ankles and knees, ensuring that the feet don't move, the ankles do not collapse in or out and the knees remain aligned over the second toe."
      },
      {
        "title": "Step 5",
        "description": "Lowered Position: From the front, the knees should continue to remain aligned over the second toe and body weight should be evenly distributed over both feet. From the side, the position of the tibia (shinbone) and torso should be parallel with each other and the low back should appear flat or showing the beginning of some rounding."
      },
      {
        "exerciseTip": "Technique is very important in this lift. The tendency is to hold the tibia (shinbone) too vertical which forces you to lean your torso too far forward. Using a mirror for feedback, shift your tibia forward while keeping your heels on the floor, then bring your torso upright back (moving it more upright), but do so from the hips and not through the low back. Squeeze your abdominals to help prevent excess arching in the back with this correction."
      }
    ],
    "bodyPart": "Back, Butt/Hips, Full Body/Integrated, Legs - Thighs",
    "category": ["Back", "Butt/Hips", "Full Body/Integrated", "Legs - Thighs"],
    "equipment": "Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/22-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/22-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/22-3.jpg"
    ]
  },
  {
    "title": "Glute Bridge Single Leg Progression",
    "id": "2315eee5-973f-4909-8042-bcf817f1a78c",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie supine (on your back) on an exercise mat or the floor in a bent-knee position with your feet flat on the floor and your arms resting comfortably along your side with the palms rotated up to face the ceiling. Start with your feet hip-width apart with the toes facing away from you, lift the left leg and place both hands on the back of the thigh to gently pull your left knee towards your chest, slide the right foot in (towards the center of the body). Gently contract your abdominal muscles to flatten your low back into the floor. Attempt to maintain this abdominal stiffness throughout the exercise."
      },
      {
        "title": "Step 2",
        "description": "Upward Phase: Gently exhale while holding your abdominal contraction and the back of your left thigh; press your right foot into the ground and lift upwards off the floor into hip extension by contracting (squeezing) your right glute (butt muscle). At the same time press your right heel into the floor for more stability. Avoid pushing your hips too high as this generally increases the amount of hyperextension (arching) in your low back. Maintaining your abdominal contraction helps avoid excessive arching in your low back."
      },
      {
        "title": "Step 3",
        "description": "Lowering Phase: Inhale and slowly lower yourself back towards your starting position by controlling the action of the right hip.  Repeat for a specific number of repetitions or a certain period of time; then alternate legs."
      },
      {
        "title": "Step 4",
        "description": "Exercise Variation: To increase the strength of the muscles along the front of the shin (anterior tibilias) pick the toes of the right foot off of the floor to hold the foot in dorsiflexion-this is a good option for runners because it could help reduce the risk of developing shin splints."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Exhale as your push your leg into the ground, inhale on the lowering phase."
      }
    ],
    "bodyPart": "Back, Butt/Hips, Legs - Thighs",
    "category": ["Back", "Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/145-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/145-2.jpg"
    ]
  },
  {
    "title": "Incline Reverse Fly",
    "id": "8ec200f5-b578-4c37-9f18-38db68f94f21",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Holding two dumbbells, sit on a bench facing the backrest angled at 45 to 60 degrees. Hold your torso against the backrest and keep your feet firmly placed on the floor. Allow your arms to hang towards the floor with your elbows slightly flexed and palms facing each other. Stiffen your core and abdominal muscles (“bracing”) to stabilize your spine."
      },
      {
        "title": "Step 2",
        "description": "Upward Phase: Exhale and slowly raise the dumbbells up and out to the sides, raising the upper arms, elbows and dumbbells in unison until the arms are near level with the shoulders. Squeeze your scapulae (shoulder blades) together as you reach the end position. In the raised position, the dumbbells should be aligned with, or slightly in front of your ears. Avoid arching your back during the upward phase by keeping your torso firmly pressed into the backrest."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Gently inhale and lower the dumbbells in unison back to your starting position."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "Technique is very important in this lift. If the dumbbells are raised to an end position behind the head rather than in line with the ears, the emphasis shifts off the shoulders and onto the latissimus dorsi (back)."
      }
    ],
    "bodyPart": "Back, Shoulders",
    "category": ["Back", "Shoulders"],
    "equipment": "Bench, Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/34-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/34-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/34-3.jpg"
    ]
  },
  {
    "title": "Kneeling Reverse Fly",
    "id": "19eaa2e6-8687-481d-bf0e-a4d6ff43141b",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneel on a mat holding resistance cable or band handles in both hands with your arms fully extended in front of your body at shoulder, or just above shoulder height. Your elbows will remain extended throughout the exercise. Grip the handles with a closed, neutral grip (thumbs wrapped around the handles and palms facing each other)."
      },
      {
        "title": "Step 2",
        "description": "Downward Movement: Gently contract your abdominal / core muscles (\"bracing\") to stiffen your torso and stabilize your spine, and depress and retract your scapulae (pull your shoulders down and back) without arching your low back and maintain this shoulder position throughout the exercise."
      },
      {
        "title": "Step 3",
        "description": "Exhale and slowly pull your arms backwards and downwards to a point level of your hips, but forming a wide arc with your movement. As your arms move backwards forming this wide arc, slowly externally rotate your arms so that your palms face upward. Maintain your erect torso position and avoid arching your low back during the movement."
      },
      {
        "title": "Step 4",
        "description": "Upward Movement: Inhale and slowly return your arms back to your starting position keeping your arms extended and torso vertical."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Try performing this exercise alongside a mirror to monitor any change in your back or shoulder position."
      }
    ],
    "bodyPart": "Back, Shoulders",
    "category": ["Back", "Shoulders"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/128-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/128-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/128-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/128-4.jpg"
    ]
  },
  {
    "title": "Lateral Neck Flexion",
    "id": "1b8b9e0a-b1c2-4f65-9647-a35287f68a28",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position:  Stand with your feet hip-width apart, toes pointing forward or turned slightly outwards, with arms by your sides. Stiffen your abdominal muscles (“brace”) to stabilize your spine, then depress and retract your scapulae (pull shoulders down and back) without arching your low back."
      },
      {
        "title": "Step 2",
        "description": "Slowly draw your right ear toward your right shoulder stopping when you feel the stretch.  Be sure to maintain body alignment keeping your shoulders down and back. Hold the stretch for 5-10 seconds.  Slowly return to starting position.  Repeat on the left side.  Perform a total of 2-4 repetitions."
      },
      {
        "title": "Step 3",
        "description": "Exercise Variation:  (1) Increase the stretch by brining your hand to the top of your head and gently applying a light pressure with your fingertips.  (2) To stretch the sternocleidomastoid, after laterally flexing the neck, slowly lift you chin upwards."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "Perform the exercise slow and controlled.  Be careful not to push to forcefully when using your hand to increase the stretch.  A light pressure is all that is needed."
      }
    ],
    "bodyPart": "Neck",
    "category": ["Neck"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/202-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/202-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/202-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/202-4.jpg"
    ]
  },
  {
    "title": "Neck Flexion and Extension",
    "id": "73ebeac6-11a0-4a8a-ab48-f8941cefa786",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position:  Stand with your feet hip-width apart, toes pointing forward or turned slightly outwards, with arms by your sides. Stiffen your abdominal muscles (“brace”) to stabilize your spine, then depress and retract your scapulae (pull shoulders down and back) without arching your low back."
      },
      {
        "title": "Step 2",
        "description": "Slowly drop your chin toward your chest (neck flexion), think of making a 'double-chin' by pressing your chin directly into your neck.    Hold for 15-30 seconds and return to starting positon."
      },
      { "title": null, "description": null },
      {
        "title": "Step 5",
        "description": "Exercise Variations:  (1)To increase the stretch during flexion, bring one hand behind your head and place your fingertips right above the base of the skull.  Apply light pressure.  (2) To increase the stretch during extension, bring one hand up to your forehead, placing only one or two fingers fingers on your forehead to apply a light pressure."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Move into each position slow and controlled.  Avoid any movement of the shoulders or shifting the head anterior and posterior."
      }
    ],
    "bodyPart": "Neck",
    "category": ["Neck"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/204-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/204-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/204-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/204-4.jpg"
    ]
  },
  {
    "title": "Prone Scapular (Shoulder) Stabilization Series - I, Y, T, W, O Formation",
    "id": "0a344701-82f3-45a9-9dd7-b502c3a9659f",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie prone (on your stomach) on a mat, with your arms and legs fully extended.  Point your toes away from your body and fully extend your elbows and fingers, positioning your palms facing inwards.  Stiffen (“brace”) your abdominal muscles to stabilize your spine, depress and retract your scapulae (pull shoulders back and down) and attempt to hold these positions throughout the exercise. Align your head with your thoracic (upper) spine."
      },
      {
        "title": "Step 2",
        "description": "“I” Formation: Gently exhale and slowly lift your arms off the floor (maintain a  formation of the letter “I”), with palms facing inward.  Keep your head aligned with your thoracic (upper) spine.  Focus on generating most of your lift through your shoulders and not the low back although some low back extension (arching) is acceptable.  Hold this position for 5 – 10 seconds then relax and return to your starting position.  Perform 2 – 4 repetitions."
      },
      {
        "title": "Step 3",
        "description": "“Y” Formation: From the same starting position, gently exhale and slowly lift your arms off the floor, moving your arms into the “Y” formation (45-degree angle to form the letter “Y”) as illustrated with palms facing inward.  Maintain your head alignment with your thoracic (upper) spine.  Focus on generating most of your lift through your shoulders and not the low back although some low back extension (arching) is acceptable.  Hold this position for 5 – 10 seconds then relax and return to your starting position.  Perform 2 – 4 repetitions."
      },
      {
        "title": "Step 4",
        "description": "“T” Formation: From the same starting position, gently exhale and slowly lift your arms off the floor, moving your arms into the “T” formation (90-degree angle to form the letter “T”) as illustrated with palms facing forward.  Maintain your head alignment with your thoracic (upper) spine.  Focus on generating most of your lift through your shoulders and not the low back although some low back extension (arching) is acceptable.  Hold this position for 5 – 10 seconds then relax and return to your starting position.  Perform 2 – 4 repetitions."
      },
      {
        "title": "Step 5",
        "description": "“W” Formation: From the same starting position, gently exhale and slowly lift your arms off the floor, flexing (bending) your elbows and dropping them to a 45-degree angle to the sides of your body as illustrated with palms facing inward (“W” formation to form the letter “W”).  Maintain your head alignment with your thoracic (upper) spine.  Focus on generating most of your lift through your shoulders and not the low back although some low back extension (arching) is acceptable.  Hold this position for 5 – 10 seconds then relax and return to your starting position.  Perform 2 – 4 repetitions."
      },
      { "exerciseTip": null }
    ],
    "bodyPart": "Back, Shoulders",
    "category": ["Back", "Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/249-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/249-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/249-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/249-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/249-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/249-6.jpg"
    ]
  },
  {
    "title": "Push Press",
    "id": "f3baa0f3-b80c-4273-a22f-6837166c92c6",
    "description": "Place a barbell in a squat rack so that the bar is slightly lower than shoulder height, and grip the bar with the hands about shoulder-width apart. Dip under the bar to lift it up and rest it on the front of shoulders, then step back away from the rack. Place the feet hip-width apart, and bend at the knees while keeping the back straight. Quickly press the feet into the floor and snap the hips forward while pushing the weight directly overhead with the elbows facing away from the body. Slowly lower the barbell to the shoulders and repeat. The power for moving the weight should come from the hips and transfer through the shoulders and arms. ",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/24-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/24-2.jpg"
    ]
  },
  {
    "title": "Seated High Back Row ",
    "id": "ea2db555-7ac9-4712-91c3-089f1e8a8eda",
    "description": "Using a cable machine and a wide bar handle and place the feet sit on a bench facing the cable with feet on the floor. Keep the knees bent and the back straight. Hold the straight portion of the bar with the palms facing down, keeping the elbows wide, and pull the bar towards the top of the chest. When the bar touches the chest, pause for a second before slowly straightening the arms to return the weight to the starting position. ",
    "bodyPart": "Arms, Back, Shoulders",
    "category": ["Arms", "Back", "Shoulders"],
    "equipment": "Bench, Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/46-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/46-2.jpg"
    ]
  },
  {
    "title": "Shoulder Packing",
    "id": "3468c2ad-c7ea-48bd-b04a-1ec72f0342e0",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet hip-width apart, toes pointing forward, with arms by your sides. Contract your abdominal muscles (“brace”) to stabilize your spine while holding your chest up and out with your head tilted slightly up."
      },
      {
        "title": "Step 2",
        "description": "Exhale and depress and retract your scapulae (pull shoulders down and back) without arching your low back. Hold the contraction for 5-10 seconds for a total of 2-4 repetitions."
      },
      { "title": "Step 3", "description": "Exercise Variations:" },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "Be sure to exhale with each contraction to help you achieve the desired range of motion.  Keep the abdominals engaged to prevent any increase in lumbar lordosis (inward curvature of the back)."
      }
    ],
    "bodyPart": "Back, Shoulders",
    "category": ["Back", "Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/205-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/205-2.jpg"
    ]
  },
  {
    "title": "Kneeling Lat Pulldown",
    "id": "267ddb84-5863-4647-a2fe-f4e5a876c8de",
    "description": [
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "exerciseTip": null }
    ],
    "bodyPart": "Back",
    "category": ["Back"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/35-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/35-2.jpg"
    ]
  },
  {
    "title": "Overhead Slams",
    "id": "b2445ce1-071c-49ee-bf4f-a8c8ac7b1b1f",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand with your feet hip-width apart and holding a medicine ball in both hands directly in front of your chest; grasp the ball with your hands in a neutral position (palms facing each other), and elbows fully flexed (bent) and facing down towards the floor."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Begin your downward phase by first shifting your hips backwards then slowly moving downwards to create a hinge-like movement at your knees. Continue to lower yourself until your feel your heels about to lift off the floor. Depress and retract your scapulae (pull your shoulders down and back) and engage your abdominal / core muscles (\"bracing\") to stiffen your torso and support your spine. Maintain a flat back by bending forward at the hips, keep your head facing forward and reach the medicine ball back between your legs to prepare to bring it up overhead in a rapid motion."
      },
      {
        "title": "Step 3",
        "description": "Upward phase: Swing the medicine ball upwards over your head while reaching it back behind your head and neck and simultaneously straightening your legs and rolling up on the balls of your toes to create triple extension (ankle plantarflexion, knee and hip extension); lean back while pushing the hips forward to lengthen the abdominal muscles, keep the abdominals contracted and engaged (bracing) throughout the movement to ensure spinal stability."
      },
      {
        "title": "Step 3",
        "description": "Upward phase: Swing the medicine ball upwards over your head while reaching it back behind your head and neck and simultaneously straightening your legs and rolling up on the balls of your toes to create triple extension (ankle plantarflexion, knee and hip extension); lean back while pushing the hips forward to lengthen the abdominal muscles, keep the abdominals contracted and engaged (bracing) throughout the movement to ensure spinal stability."
      },
      {
        "title": "Step 4",
        "description": "Explosively bring the ball down over your head to throw it directly downwards into the floor while dropping your weight back into your hips.  As you throw the ball down, make sure you are maintaining the abdominal bracing and hinge from the hips to maintain spinal stability."
      },
      {
        "exerciseTip": "If using a bouncing medicine ball make sure that you have ample space for safety; if you are using a non-bouncing medicine ball (a \"dead\" ball) make sure you are on a solid, stable floor that can support the force of the weight being thrown explosively into the floor."
      }
    ],
    "bodyPart": "Back, Butt/Hips, Full Body/Integrated, Legs - Thighs, Shoulders",
    "category": [
      "Back",
      "Butt/Hips",
      "Full Body/Integrated",
      "Legs - Thighs",
      "Shoulders"
    ],
    "equipment": "Medicine Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/182-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/182-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/182-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/182-4.jpg"
    ]
  },
  {
    "title": "Seated High Back Rows",
    "id": "d480aeca-1c1f-47c7-8092-f3bf027dcb06",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Adjust the seat height to a level that positions the machine handles approximately level with your shoulders. Position your feet firmly on the floor or foot pads to stabilize your body.  Sit upright and extend your arms to grasp the handles without rounding your shoulders forward. Adjust the position the chest pad to contact your chest lightly.  Stiffen (“brace”) your abdominal muscles to stabilize your spine, but do not press your low back into the back rest. Maintain the natural arch in your low back and avoid arching your back throughout the exercise.  Depress and retract your scapulae (pull shoulders back and down), maintain a neutral wrist position (i.e., wrist in line with your forearms) and attempt to hold these positions throughout the exercise."
      },
      {
        "title": "Step 2",
        "description": "From this start position with your torso vertical, scapulae (shoulder blades) flat against your ribcage and arms extended, gently exhale and perform a pulling movement. Flex (bend) your elbows and pull them towards your chest, but try to flair your elbows out from your sides, keeping them as level with your shoulders as possible. Continue to maintain a neutral wrist position, and contact with your chest against the chest pad.  Avoid leaning back and arching your low back and attempt to minimize any movement of your head during the movement."
      },
      {
        "title": "Step 3",
        "description": "Continue pulling until your elbows reach level with, or pass just behind your shoulders. Pause momentarily then slowly return to your starting position, allowing the weight to pull your arms to move forward and elbows to extend (straighten) in a slow, controlled manner; the weight should straighten your arms but use your back muscles to resist the pull as the handles move away from your body, stopping when your arms are fully extended.  Maintain an upright trunk position with your spine straight and your chest lifted upwards toward the ceiling.  Do not let your spine bend forward and your back to round during this exercise.  Repeat the movement for a specific number of repetitions."
      },
      {
        "title": "Step 4",
        "description": "Exercise Variation: To increase the exercise intensity and involve additional exercises, perform the following variations:"
      },
      {
        "title": null,
        "description": "(b) Move the chest pad away from your body, which will now require a greater effort to stabilize your trunk as you perform the pulling movement."
      },
      {
        "exerciseTip": "Allowing your shoulders to round forward as your arms extend will allow you to pull with more force. However, learn how to perform a pulling motion without scapulae (shoulder blade) movement first before introducing shoulder movement.  Additionally, reduce unnecessary stresses into your low back by avoiding any backwards lean during the pull movements."
      }
    ],
    "bodyPart": "Arms, Back",
    "category": ["Arms", "Back"],
    "equipment": "Weight Machines / Selectorized",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/169-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/169-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/169-3.jpg"
    ]
  },
  {
    "title": "Seated Row ",
    "id": "65673f52-2232-4244-ac5a-1b491442ee45",
    "description": "Use a seated pulley cable machine and a narrow handle, and place the feet on the floor with knees bent and maintain a straight back. Hold the handle and lift the chest while slowly pulling the elbows backwards close to the rib cage until the handle touches the front of the stomach. Pause for one second before slowly straightening the arms to return the weight to the original starting position. ",
    "bodyPart": "Arms, Back",
    "category": ["Arms", "Back"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/48-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/48-2.jpg"
    ]
  },
  {
    "title": "Shoulder Stability-Mobility Series - I, Y, T, W Formations ",
    "id": "14444891-5487-4e93-b5c9-ef8f844bd188",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie flat on your back on the floor / mat in a bent-knee position with feet placed firmly on the floor.  Position your arms to your sides with elbows extended and palms facing inwards.  Stiffen (“brace”) your abdominal muscles to stabilize your spine, depress and retract your scapulae (pull shoulders back and down) without moving your trunk and attempt to hold this positions throughout the exercise."
      },
      {
        "title": "Step 2",
        "description": "“I” Formation: Gently exhale and slowly extend your arms overhead keeping your elbows extended, while maintaining your depressed shoulder position and stable spine (avoid arching your back). Individuals experiencing some limitations in their flexibility will tend to shrug their shoulders and arch their back during this movement.  Continue to move your arms overhead until your thumbs touch the floor overhead, or until you reach the point of tension, but avoid bouncing or pushing to the point of pain.  Hold this position for 15 – 30 seconds then relax and return to your starting position.  Perform 2 – 4 repetitions."
      },
      {
        "title": "Step 3",
        "description": "“Y” Formation: From the same starting position, gently exhale and slowly extend your arms into the “Y” formation (45-degree angle to form the letter “Y”) as illustrated, while maintaining your elbows extended, depressed shoulder position and stable spine (avoid arching your back).  Continue to move your arms until your thumbs touch the floor in the “Y” position, or until you reach the point of tension, but avoid bouncing or pushing to the point of pain.  Hold this position for 15 – 30 seconds then relax and return to your starting position.  Perform 2 – 4 repetitions."
      },
      {
        "title": "Step 4",
        "description": "“T” Formation: From the same starting position, gently exhale and slowly raise your arms until vertical with the floor, then open up to your sides into the “T” formation (90-degree angle to form the letter “T”) as illustrated, while maintaining your elbows extended, depressed shoulder position and stable spine (avoid arching your back).  Continue to move your arms until the backs of your hands touch the floor in the “T” position, or until you reach the point of tension, but avoid bouncing or pushing to the point of pain.  Hold this position for 15 – 30 seconds then relax and return to your starting position.  Perform 2 – 4 repetitions."
      },
      {
        "title": "Step 5",
        "description": "“W” Formation and Wipers: From the same starting position, flex (bend) your elbows and externally rotate (turn out) your arms until the back of your forearms touch, or come close to touching the floor (forming the letter “W” as illustrated), while maintaining your elbows extended, depressed shoulder position and stable spine (avoid arching your back).  Gently exhale and slowly slide your arms overhead along the floor while maintaining your bent-elbow position until your hands touch above your head or until you reach the point of tension, but avoid bouncing or pushing to the point of pain (sometimes referred to as “snow angels”).  Hold both the “W” and overhead positions for 10 - 15 seconds then relax and slide your arms back to your “W” formation.  Perform 2 – 4 repetitions."
      },
      { "exerciseTip": null }
    ],
    "bodyPart": "Shoulders",
    "category": ["Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/237-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-6.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-7.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-8.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-9.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/237-10.jpg"
    ]
  },
  {
    "title": "Shrug",
    "id": "0ee81de3-1a40-4199-a182-cf3b4384c093",
    "description": "Hold a barbell with a palms-down grip with the hands about shoulder-width apart. Keep the knees slightly bent, the hips straight, and the back tall, and raise the shoulders directly upwards to the ears as high as possible, lowering slowly to the original starting position. (Tip: grip the bar and think about pulling the hands apart from one another and focus on only raising/lowering the shoulders - DO NOT roll the shoulders.) ",
    "bodyPart": "Back",
    "category": ["Back"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/72-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/72-2.jpg"
    ]
  },
  {
    "title": "Side-lying Arm Rolls",
    "id": "c8f245b8-6d7f-4b8e-9050-fdae4cd92a28",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie flat on your back on a mat in a bent-knee position and place a small pillow, rolled-up towel or foam pad under your head.  Depress and retract your scapulae (pull shoulders back and down) without moving your trunk and attempt to hold this position throughout the exercise. While holding a light dumbbell or weight in one hand, press that arm vertically while maintaining a neutral wrist (i.e., wrist aligned with your forearm) and scapula (shoulder blade) in contact with the mat.  Place your opposite arm at the side of your body."
      },
      {
        "title": "Step 2",
        "description": "Stiffen (“brace”) your abdominal muscles to stabilize your spine and maintain this throughout the exercise. Gently exhale and rotate your trunk and legs slowly towards the arm placed at your side while keeping the extended arm vertical to the floor at all times and the upper shoulder stable (i.e., no movement of the shoulder blade).  Continue to rotate until your belly button is level with the floor. This places a significant stretch and increased load into the upper shoulder.  Control movement (stabilize) in this shoulder and avoid any arching in your low back that may accompany the rotation.  Stiffening (\"bracing\") your abdominal muscles will help prevent this."
      },
      {
        "title": "Step 3",
        "description": "Pause momentarily then slowly return back to your starting position.  Perform 1 set x 5 – 10 repetitions at a slow, controlled tempo (pace), then repeat to the opposite side."
      },
      {
        "title": "Step 4",
        "description": "Exercise Variation: If a light dumbbell is not available, perform this exercise without any resistance or with any weighted device. The exercise complexity is increased by holding a kettle bell that has an “offset center of mass.”"
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "To maximize the benefits of this exercise and reduce the potential for injury, it is often important to stabilize the scapula and control movement carefully.  Follow the instructions provided carefully"
      }
    ],
    "bodyPart": "Abs, Shoulders",
    "category": ["Abs", "Shoulders"],
    "equipment": "Dumbbells, No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/223-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/223-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/223-3.jpg"
    ]
  },
  {
    "title": "Back Squat",
    "id": "3cd4d468-618b-4151-a73b-824436033921",
    "description": "Place a barbell in a rack just below shoulder-height. Dip under the bar to put it behind the neck across the top of the back, and grip the bar with the hands wider than shoulder-width apart. Lift the chest up and squeeze the shoulder blades together to keep the straight back throughout the entire movement. Stand up to bring the bar off the rack and step backwards, then place the feet so that they are a little wider than shoulder-width apart. Sit back into hips and keep the back straight and the chest up, squatting down so the hips are below the knees. From the bottom of the squat, press feet into the ground and push hips forward to return to the top of the standing position.",
    "bodyPart": "Butt/Hips, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Thighs"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/11-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/11-2.jpg"
    ]
  },
  {
    "title": "Deadlift",
    "id": "ab5ce828-5cba-400d-b40e-6f7f498126bf",
    "description": "Stand behind the barbell with the feet about shoulder-width apart, the toes slightly rotated out, and the shins almost touching the bar. Sit back into the hips slightly while keeping a straight back so that the chest is lifted upward, and bend forward to grip the bar in an over-under grip with one palm facing up and the other facing down. Squeeze the bar in the hands and sink back onto the hips while pressing the feet into the floor. Keeping the back flat, push the hips forward to move to standing position. Finish standing in a tall position with the shoulders pulled back and the legs straight. Return to the starting position by shifting the weight back into the hips and keep the back straight while allowing the knees to bend. When this movement is done properly, the glutes and the back of the thighs should feel the work, NOT the back. ",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/6-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/6-2.jpg"
    ]
  },
  {
    "title": "Agility Ladder: Lateral Shuffle",
    "id": "e3d6c2dd-f30b-4ff7-afe3-a00c42f997fc",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand directly in a square at one end of the ladder with your feet approximately hip-width apart."
      },
      {
        "title": "Step 2",
        "description": "Bend your hips and drop into an athletic ready position so that your knees are slightly bent and your chest is directly over your toes.  Your arms should be bent with the elbows fixed at approximately ninety degrees (during the drill ensure that the swinging is coming from the shoulder joint and not from the elbows)."
      },
      {
        "title": "Step 3",
        "description": "Shift your bodyweight so that your weight is in your left leg.  Pick up the right foot and place it in the square next to the starting square while pushing the left foot in to the ground to move your body to your right and in to the next square of the ladder."
      },
      {
        "title": "Step 4",
        "description": "Your right foot should hit the ground at the ball of the foot and roll all the way down to the heel, as the entire right foot hits the ground shift your body weight off of the left leg and place your weight on the right leg.  Once your bodyweight is on your right leg pick up your left foot to bring it into the same square as the right foot.  Keep your hips flexed and knees bent so that you maintain an athletic ready position throughout the length of the entire ladder."
      },
      {
        "title": "Step 5",
        "description": "Continue to move down the ladder to your right; keep the bodyweight in the left leg while picking up the right foot to move it to the next square to the right; as the right foot hits the square, push off with the left foot and keep the bodyweight centered on top of the right leg.  Be sure to move both ways through the ladder; once you've done a certain number of repetitions to the right, be sure to switch directions and do the same number of repetitions moving to your left (pushing off of the right foot)."
      },
      { "exerciseTip": null }
    ],
    "bodyPart": "Butt/Hips, Full Body/Integrated, Legs - Calves and Shins, Legs - Thighs",
    "category": [
      "Butt/Hips",
      "Full Body/Integrated",
      "Legs - Calves and Shins",
      "Legs - Thighs"
    ],
    "equipment": "Ladder",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/170-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/170-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/170-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/170-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/170-5.jpg"
    ]
  },
  {
    "title": "Alternate Leg Push-off ",
    "id": "6a181630-d656-4e0c-83b1-0e5555689f0a",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand facing a raised platform or a plyometric jump box, place your right foot on the top of the step or box, keep your left foot on the ground, hinge from the hips to lean forward, keep your arms by your side with your right arm in shoulder extension behind you and your left arm in shoulder flexion in front of you, keep your head level with your eyes looking at a point on the ground two-to-three feet in front of you."
      },
      {
        "title": "Step 2",
        "description": "Upward phase: Jump straight up into the air by explosively pushing your right foot in to the top of the box to create triple extension (ankle plantarflexion, knee and hip extension) while simultaneously pushing off with your left foot and swinging your right arm up and in front of your body to help generate upward momentum.  As you jump into the air lift up your left leg in order to keep your feet level with each other and parallel with the floor."
      },
      {
        "title": "Step 3",
        "description": "Mid-air: as you are in the air quickly swing your left leg forward and your right leg back so that you will land with your left foot on top of the platform and your right leg behind you on the floor."
      },
      {
        "title": "Step 4",
        "description": "Landing: The most important components of the landing phase are correct foot position and avoiding excessive forward movement in your lower extremity which places additional stresses upon your knees. Attempt to land softly and quietly on the mid-foot, rolling backwards quickly towards the heels. Always push your hips backwards and drop them downwards to absorb the impacting forces associated with jumping. Avoid locking out your knees or quads on your landing as this may lead to potential knee injuries. Land with your trunk inclined slightly forward, head aligned with your spine and back rigid or flat. Keep your abdominal / core muscles engaged, stiffening your torso to protect your spine."
      },
      {
        "title": "Step 5",
        "description": "Exercise Variation: When you are learning this exercise focus on the soft landing and reset your body in the correct position for the next jump and pause for a moment between jumps to ensure good form.  As you improve minimize the rest time so that you are rapidly moving from one jump to the next."
      },
      {
        "exerciseTip": "When jumping keep your spine straight and tall by contacting your abdominals (bracing) and be sure to perform the same number of repetitions on each leg."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Calves and Shins, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Calves and Shins", "Legs - Thighs"],
    "equipment": "Raised Platform/Box",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/246-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/246-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/246-3.jpg"
    ]
  },
  {
    "title": "Box Jumps",
    "id": "6f70db14-205c-4127-9917-5a61da241cc9",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Place a 6-12\" raised platform or box on the floor 3-6\" in front of your feet on a non-slip surface. Stand with your feet hip-width apart or closer, arms by your sides, depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Begin your downward phase by first shifting your hips backwards then slowly moving downwards to create a hinge-like movement at your knees. Continue to lower yourself until your feel your heels about to lift off the floor. Try to maintain a flat back by bending forward at the hips, keep your head facing the box and position your arms where comfortable or where they offer the greatest degree of balance support."
      },
      {
        "title": "Step 3",
        "description": "Jumping Movement: With ONLY a very brief pause at the bottom of your downward phase, explode upwards through your lower extremity while swinging your arms forward and jumping onto the top of the raised platform or box, achieving triple extension (pushing and extending your ankles, knees and hips simultaneously). As you jump into the air, keep your feet level with each other and parallel with the floor."
      },
      {
        "title": "Step 4",
        "description": "Landing: The most important components of the landing phase on a raised platform or box are correct foot position and avoiding excessive forward movement in your lower extremity which places additional stresses upon your knees."
      },
      {
        "title": "Step 5",
        "description": "Attempt to land softly and quietly on the mid-foot, rolling backwards quickly towards the heels to create a level foot, parallel with the surface. Always push your hips backwards and drop your hips to absorb the jumping forces. Avoid locking your knees and quads on your landing as this may lead to potential knee injuries."
      },
      {
        "exerciseTip": "Learn first how to squat and perform regular squat jumps before attempting to perform box jumps. The height of the platform / box should not exceed your vertical jump height."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Calves and Shins, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Calves and Shins", "Legs - Thighs"],
    "equipment": "Raised Platform/Box",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/115-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/115-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/115-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/115-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/115-5.jpg"
    ]
  },
  {
    "title": "Bulgarian Split Squat",
    "id": "1b583f68-c7e3-486a-a719-b93a9753a51c",
    "description": "Start with the feet hip-width apart, with the right foot forward and the left foot placed back behind the body on a bench or box that is about knee-height. Hold a dumbbell in both hands in a vertical position in front of the chest and keep the elbows close to the rib cage during the exercise. Keep the back straight while lowering the left knee towards the floor. Before the left knee hits the floor, press the right foot into the ground, pull back on the right knee, and push the top of the left foot into the box to return to standing.",
    "bodyPart": "Butt/Hips",
    "category": ["Butt/Hips"],
    "equipment": "Bench, Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/366-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/366-2.jpg"
    ]
  },
  {
    "title": "Forward Stepping over Cones ",
    "id": "69e5ccd1-033c-4563-bba6-2f96a9710063",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Place a series of cones 18-30\" apart in a straight line on a non-slip surface. Stand 6\" behind the first cone with your feet hip-width apart or closer, arms by your sides. Depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "Walking Movement: Slowly lift one foot off the floor to clear the height of the cone, stabilizing your body on the stance (supporting) leg. Avoid any sideways tilting or swaying in your upper body and try not to move the stance (supporting) foot. Hold this position momentarily before stepping forward, pushing off your stance (supporting) leg to clear the cone."
      },
      {
        "title": "Step 3",
        "description": "The raised leg should initiate contact over the cone with a heel strike first, followed by the mid- and fore-foot, transferring your body weight into that foot. As you load into this leg, avoid any sideways tilting or swaying in your upper body and try not to move the stance (supporting) foot. Your trailing leg needs to also clear the cone."
      },
      {
        "title": "Step 4",
        "description": "Continue this sequence through the series of cones."
      },
      {
        "title": "Step 5",
        "description": "Exercise Variation: This exercise can be progressed in several ways: (1) lift each leg higher off the floor (illustrated) to further challenge your balance (raising center of mass), (2) walk through the cones at a faster pace, (3) step sideways through the cones, or (4) step backwards through the cones."
      },
      { "exerciseTip": null }
    ],
    "bodyPart": "Abs, Butt/Hips",
    "category": ["Abs", "Butt/Hips"],
    "equipment": "Cones",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/111-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/111-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/111-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/111-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/111-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/111-6.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/111-7.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/111-8.jpg"
    ]
  },
  {
    "title": "Bottom-up Press",
    "id": "8e9bc89e-2265-4440-ac74-32f59512c358",
    "description": "Stand with the feet hip-width apart so that the right foot is slightly in front of the left and hold a kettlebell in the right hand in a ‘bottom-up’ position by holding the top of the handle so that the bottom of the kettlebell is facing up. Keep a strong grip to maintain balance of the kettlebell. Push the right foot into the ground to shift the weight of the body forward while pressing the right arm straight overhead. Pull the right elbow back down to the rib cage to lower the weight. ",
    "bodyPart": "Chest, Full Body/Integrated, Shoulders",
    "category": ["Chest", "Full Body/Integrated", "Shoulders"],
    "equipment": "Kettlebells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/396-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/396-2.jpg"
    ]
  },
  {
    "title": "Halo",
    "id": "63ed5840-f4a3-4f2b-9d75-c938649ef0e6",
    "description": "Stand with the feet approximately shoulder-width apart and hold a kettlebell by the horns directly in front of the chest. Keep the back straight while moving the kettlebell from in front of the chest to over the right shoulder, reaching across the body with the left arm. Continue moving the kettlebell around and behind the head to bring it back to the chest by passing it over the left shoulder. Continue for the desired number of repetitions before switching directions.",
    "bodyPart": "Back, Butt/Hips, Chest, Full Body/Integrated, Legs - Thighs, Shoulders",
    "category": [
      "Back",
      "Butt/Hips",
      "Chest",
      "Full Body/Integrated",
      "Legs - Thighs",
      "Shoulders"
    ],
    "equipment": "Kettlebells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/394-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/394-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/394-3.jpg"
    ]
  },
  {
    "title": "Incline Chest Press",
    "id": "7db1e4b3-d9a6-41a6-a826-5d351f56aa4a",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Grasp two dumbbells and lie supine (on your back) on an incline bench angled between 45 and 60 degrees with your feet placed firmly on the floor or on a raised platform to allow you to maintain a neutral spine (flat to normal curvature)."
      },
      {
        "title": "Step 2",
        "description": "Depress and retract your scapulae (pull shoulders down and back) to make firm contact with the bench. Your head, shoulders, butt and feet should make contact with the bench and floor/riser throughout the exercise. If using a spotter, signal for assistance in moving to your starting position. Grasp each dumbbell with a closed, pronated grip (palms facing forward, thumbs wrapped around the handle) and press the dumbbells in unison to a level over your eyes or slightly higher, with your elbows fully extended. Maintain a neutral wrist position (avoid flexion / extension at the wrist joint)."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Inhale and slowly lower the dumbbells in unison and in a controlled movement towards your upper chest, but moving slightly wider towards the armpits. Gently touch the dumbbells to your chest without bouncing, maintaining your neutral wrist position. Keep the elbows under your wrists, and either close to your sides (emphasizes more triceps) or flared out from the body (emphasizes more pectorals). Maintain all points of contact with the bench and floor/riser and avoid any arching in the low back."
      },
      {
        "title": "Step 4",
        "description": "Upward Phase: Exhale and gently press upwards to full elbow extension with the dumbbells positioned at your starting position. Maintain your points of contact with the bench and floor/riser, avoid arching your back during the lift and maintain your neutral wrist position throughout the movement."
      },
      {
        "title": "Step 5",
        "description": "At the end of the set, signal your spotter to assist you in taking the dumbbells and maintain a firm grip until the dumbbells are taken from your hands."
      },
      {
        "exerciseTip": "Safety is very important in this exercise. A spotter should adopt a split-stance position with the hands positioned as close to the most distal (wrist) joint. Keep the hands near, but not touching the wrists unless needed."
      }
    ],
    "bodyPart": "Chest, Shoulders",
    "category": ["Chest", "Shoulders"],
    "equipment": "Bench, Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/25-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/25-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/25-3.jpg"
    ]
  },
  {
    "title": "Lying Chest Fly",
    "id": "dc57aaf9-afa2-4685-a5d7-83f8d890cb39",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Grasp two dumbbells and lie supine (on your back) on a flat bench with your feet placed firmly on the floor or upon a raised platform to allow you to maintain a neutral (flat to normal) spine. If working with a spotter, signal the spotter for assistance in handing you the dumbbells."
      },
      {
        "title": "Step 2",
        "description": "Depress and retract your scapulae (pull shoulders down and back) to make firm contact with the bench. Your head, shoulders, butt and feet should make contact with the bench and floor/riser throughout the exercise. Signal the spotter for assistance in moving to the starting position. Grasp each dumbbell with a closed, pronated grip (palms facing forward, thumbs wrapped around the handle), pressing the dumbbells to a position shoulder-width apart with your elbows extended. Externally rotate the arms (rotate your elbows to face outward and palms to face inward), slightly flexing the elbows, but maintaining a neutral wrist position (avoid flexion/extension at the wrist joint)."
      },
      {
        "title": "Step 3",
        "description": "Downward Phase: Inhale and slowly lower the dumbbells in unison in a wide arc until they lie level with your shoulders or chest. Keep the dumbbells parallel with each other during the movement. Maintain your slightly flexed elbows, neutral wrist position and contact of your head, shoulder, butt and feet with the bench and floor/riser."
      },
      {
        "title": "Step 4",
        "description": "Upward Phase: Exhale and slowly raise the dumbbells upward in a wide arc back to your starting position, keeping the elbows slightly flexed, wrists neutral and making contact with the head, shoulders, butt and feet with the bench and floor/riser."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Safety is very important in this exercise. A spotter should adopt a split-stance position or half-kneeling position with the hands positioned as close to the most distal (wrist) joint. Keep the hands near, but not touching the wrists unless needed."
      }
    ],
    "bodyPart": "Chest, Shoulders",
    "category": ["Chest", "Shoulders"],
    "equipment": "Bench, Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/21-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/21-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/21-3.jpg"
    ]
  },
  {
    "title": "Lying Pullovers",
    "id": "9af9872d-4d7b-4a8a-8972-f8ec5a94b21c",
    "description": "Lie face up on a bench with the feet resting comfortably on the floor, and straighten the arms above the chest while holding one dumbbell in each hand with the palms facing each other. Slowly stretch the arms up overhead while keeping the elbows straight. Once the arms are overhead slowly pull the weights back up to the original starting position. Repeat for the desired number of repetitions.",
    "bodyPart": "Chest",
    "category": ["Chest"],
    "equipment": "Bench, Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/37-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/37-2.jpg"
    ]
  },
  {
    "title": "Plank-ups",
    "id": "988eab55-7f3b-4ec4-b929-e6af900f477e",
    "description": "Start in a push-up position with the hands under the shoulders and the legs stretched out directly behind. Squeeze the thigh and glute muscles to keep body and legs in a straight line, and lower down to the elbows one elbow at a time. From this position on the elbows, press the hands into the floor one at a time to return to the push-up position.  ",
    "bodyPart": "Abs, Arms, Chest",
    "category": ["Abs", "Arms", "Chest"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/320-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/320-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/320-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/320-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/320-5.jpg"
    ]
  },
  {
    "title": "Spider Walks",
    "id": "b936573d-9961-4813-99bc-fbd7ccdf0004",
    "description": "Start in a push-up position with the hands shoulder-width apart and the legs straight out directly behind the body about hip-width apart. Push the toes of the left foot into the floor and squeeze the left thigh and glute while moving the right knee forward to the outside of the right elbow. While the right leg is forward, push back through the left heel to straighten the left leg. Then straighten the right leg and bring the left knee forward to the outside of the left elbow while reaching forward with the right hand. Alternate this arm and leg action for the desired distance.",
    "bodyPart": "Arms, Full Body/Integrated",
    "category": ["Arms", "Full Body/Integrated"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/247-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/247-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/247-3.jpg"
    ]
  },
  {
    "title": "Spinal Twist with a Push-Pull Movement",
    "id": "4f7f8d28-504c-4dbd-83bf-645b82523726",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie on your side on a mat with both legs extended so that your hips and shoulder are aligned vertically with the floor and your spine and head are in alignment (head resting on the mat or upon a small pillow or rolled-up towel). Bend your upper leg to create a 90-degree bend at both the hip and knee, resting the inside of that knee upon the mat or upon a raised platform, (e.g., rolled-up towel, block, etc.). Extend both arms out directly in front you at chest level, overlapping your fingers together."
      },
      {
        "title": "Step 2",
        "description": "Stiffen (“brace”) your abdominal muscles to stabilize your spine in a neutral position and maintain this throughout the exercise. Gently exhale and slowly rotate your trunk and upper arm until your belly button faces the ceiling and your upper arm extends out to the side, either touching or being elevated slightly above the floor."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "title": null,
        "description": "(a) Press the lower arm upwards, extending the elbow without allowing the scapula to move forward"
      },
      {
        "exerciseTip": "To maximize the benefits of this exercise and reduce the potential for injury, it is often important to stabilize the scapulae, trunk and hips and control movement at the shoulders.  Follow the instructions provided carefully."
      }
    ],
    "bodyPart": "Back, Chest, Shoulders",
    "category": ["Back", "Chest", "Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/219-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/219-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/219-3.jpg"
    ]
  },
  {
    "title": "Supine Snow Angel (Wipers) Exercise",
    "id": "1fb98e8f-24d4-4b22-939d-a864721a17d2",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie supine (on your back) on an exercise mat or firm surface, bending your knees until your feet are positioned flat on the floor 12-18\" from your buttocks. Place your arms at your sides, with elbows fully extended and palms facing inward. Breathe deeply for a 30 seconds relaxing your body and allowing gravity to gently pull your lower back and shoulders towards the floor."
      },
      {
        "title": "Step 2",
        "description": "Depress and retract your scapulae (pull your shoulder down and back) without increasing the arch in your low back or lifting your hips off the mat / floor. Contract your abdominal / core muscles to flatten your low back into the mat and hold this position throughout the exercise."
      },
      {
        "title": "Step 3",
        "description": "Slide your arms out from your sides forming a 45-degree angle with your torso, keeping your upper arms making contact with the mat / floor. Bend your elbows to a comfortable position and keep your wrists in a neutral position (aligning the backs of your forearms, wrists and hands)."
      },
      {
        "title": "Step 4",
        "description": "Upward Movement: Exhale and gently rotate your upper arms, sliding the mat / floor to an end position where your hands touch overhead and your elbows have a comfortable bend. Attempt to keep much of the back of your upper arms, forearms, wrists and hands in contact with, or near the mat/ floor and avoid arching your lower back as your rotate overhead."
      },
      {
        "title": "Step 5",
        "description": "Downward Movement: Inhale and gently rotate your arms back to your starting position, attempting to keep your upper arms, forearms, wrists and hands in contact with, or near the mat/ floor and avoid arching your lower back as your rotate overhead."
      },
      {
        "exerciseTip": "This exercise stretches the muscles of your shoulders and lats in a stable and isolated manner. Reducing movement restriction in the shoulder helps minimize the likelihood of shoulder injury and pain. Try performing this exercise adjacent to a mirror that will allow you to monitor any undesired movement in the hips, ribs, shoulder or low-back."
      }
    ],
    "bodyPart": "Abs, Chest, Shoulders",
    "category": ["Abs", "Chest", "Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/124-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/124-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/124-3.jpg"
    ]
  },
  {
    "title": "Anti-rotation Reverse Lunge",
    "id": "82c6e41f-1640-483f-8c4f-9c173dd22882",
    "description": "Stand with the feet hip-width apart and keep the hips straight with the knees slightly bent. Put the cable pulley at about chest-height, and stand with it directly to the left of the body. Grip a handle in both hands with fingers laced together, straighten the arms out in front, keep back straight and tall, while simultaneously stepping backwards into a lunge with the left foot so the left knee is close to the ground. Push off the right foot and bring the left leg forward to return to standing.",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/348-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/348-2.jpg"
    ]
  },
  {
    "title": "Asynchronous Waves",
    "id": "61575ae0-0f55-4525-93ec-780933d999cb",
    "description": "Securely attach a heavy rope to an anchor point, grab one end of the rope in each hand with the palms down. Stand with the feet about shoulder-width apart with both the hips and knees slightly bent, and hold both lines of rope directly in front. Hold one end of the rope in each hand and keep the elbows close to the body. Lift the right arm up quickly before snapping it down to create a wave down the rope. As the right arm comes down quickly, lift the left arm at the same time to start moving the left side of the rope. Alternate arms to explosively snap the rope up and down for the duration of the exercise. ",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Heavy Ropes",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/376-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/376-2.jpg"
    ]
  },
  {
    "title": "Burpee",
    "id": "6cecfdde-1073-4118-9e75-e151b9655cdb",
    "description": "Begin in a plank position with the BOSU directly under the shoulders and the legs out behind the body, dome facing down. Jump the feet forward near the dome into a deep squat, and keep hold of the BOSU while lifting it straight over the head extending the arms. Bring the BOSU back to the floor and jump the legs out behind the body again. ",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "BOSU Trainer",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/306-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/306-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/306-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/306-4.jpg"
    ]
  },
  {
    "title": "Clean and Press",
    "id": "4b179392-6386-4397-8495-384397f15bce",
    "description": "Stand with the feet hip-width apart and grip the kettlebell tightly in the left hand. Keep the back straight while sinking slightly into the hips to allow the kettlebell to swing back under the hips between the legs. Drive the hips forward to swing the kettlebell forward, and as the kettlebell gains forward momentum in front of the body, quickly pull it up to the chest and immediately drop the elbow towards the rib cage and sink back into the hips to catch the kettlebell up by the left shoulder. From this racked position, sink back into the hips, explosively push the feet into the floor, and snap the hips forward while punching the left arm straight into the air to complete the press. Lower the kettlebell by pulling the left elbow down towards the rib cage, sinking back into the hips, and after the kettlebell has lowered to shoulder-height, letting it drop down between the legs. Repeat for the desired number of repetitions before switching sides.",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Kettlebells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/383-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/383-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/383-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/383-4.jpg"
    ]
  },
  {
    "title": "Double Push-press",
    "id": "ea11a673-9bb7-4335-865d-196cb33047d1",
    "description": "Stand with the feet about shoulder-width apart and grip one kettbell in each hand while they are on the ground inside the feet. Pick up both at the same time. Hold one kettlebell in each arm on the chest near the shoulder, with the elbows close to the rib cage and the wrists bent to keep the kettlebell held firmly to the forearm. Keep the back tall and bend the knees to dip slightly at the hips before explosively pushing both feet into the floor and snapping the hips forward to punch both arms straight into the air. As the arms reach full extension, stand straight up. Slowly lower both weights by pulling the elbows down to the rib cage to bring the kettlebells back to the original racked position on the chest and shoulders. ",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Kettlebells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/384-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/384-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/384-3.jpg"
    ]
  },
  {
    "title": "Double Rotation Waves",
    "id": "1fd721cb-e89d-4e84-bc52-d3b71c064fa3",
    "description": "Securely attach a heavy rope to an anchor point, grab one end of the rope in each hand with the palms down. Stand with the feet about shoulder-width apart with both the hips and knees slightly bent, and hold both lines of rope directly in front. Keep the elbows close to the body and begin to lift both ends of the rope outwardly (the right will move counter-clockwise and the left will move clockwise) at the same time to create circular waves along the entire length of the rope. Continue moving the rope with both hands at the same time in opposite directions for the duration of the exercise. ",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Heavy Ropes",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/378-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/378-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/378-3.jpg"
    ]
  },
  {
    "title": "Farmer's Carry",
    "id": "d110efbd-8ea4-4b84-ad23-db17a8b33796",
    "description": "Hold a dumbbell in each hand with a tight, firm grip and the palms facing down, and allow the arms to rest along the sides of the body so the dumbbells are next to each hip. Keep the back straight and walk a specified, pre-determined distance. Once reaching the end, turn around and return to the starting point.",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/359-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/359-2.jpg"
    ]
  },
  {
    "title": "Figure Eight",
    "id": "5437c17d-2630-4f71-b52a-8399bf5ee504",
    "description": "Stand with both feet on the floor wider than shoulder-width apart, grip a kettlebell with the left hand, and bend the knees to squat down until the thighs are parallel to the ground. Reach the right arm behind the right leg and pass the kettlebell under the right leg, passing it from the left hand to the right. Swing the kettlebell around the outside of the right leg with the right arm and in towards the inside of the left leg while reaching the left arm around the outside of the left leg. Complete the figure-8 by passing the kettlebell from the left hand to the right under the left leg. Continue passing the kettlebell from one hand to the other for a desired number of repetitions. ",
    "bodyPart": "Full Body/Integrated",
    "category": ["Full Body/Integrated"],
    "equipment": "Kettlebells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/382-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/382-2.jpg"
    ]
  },
  {
    "title": "Ankle Flexion ",
    "id": "c004f1db-f491-4bec-8ae9-2d6a26d0f810",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Assume a seated position, extending one leg out in front. Secure a cable or resistance band around the ball of that foot. The resistance should be pulling the bottom of your foot away from you."
      },
      {
        "title": "Step 2",
        "description": "Start with your foot in plantar flexion (toes pointed forward away from your body) and slowly dorsiflex the ankle (pulling your toes towards your shin). Slowly return to your starting position, controlling the speed of movement and repeat."
      },
      {
        "title": "Step 3",
        "description": "The movement comes from your ankle, so avoid any bending or full extension of your knee throughout the movement. Always aim to keep your foot aligned facing forward."
      },
      {
        "title": "Step 4",
        "description": "As an exercise progression, modify your movement to include a slight foot rotation as you dorsiflex the ankle (toes point towards the ceiling). The direction of your slight rotation should be into inversion (bringing the big toe towards your shin bone)."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Attempt to sit upright and avoid any excessive arching or slouching in the low back."
      }
    ],
    "bodyPart": "Legs - Calves and Shins",
    "category": ["Legs - Calves and Shins"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/23-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/23-2.jpg"
    ]
  },
  {
    "title": "Calf Raise",
    "id": "279a1de3-4445-4593-98e2-9c780cdf486a",
    "description": "Adjust the weight to the appropriate level before beginning. Adjust the seat and the pad so the legs are straight out in front and slightly below the hips. With the ball of the foot on the platform, press through the toes as far as possible, keeping legs straight. Slowly return to the starting position. ",
    "bodyPart": "Legs - Calves and Shins",
    "category": ["Legs - Calves and Shins"],
    "equipment": "Weight Machines / Selectorized",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/294-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/294-2.jpg"
    ]
  },
  {
    "title": "Calf Raises",
    "id": "911c19ae-8f93-4077-b5e8-df75fd7bcc11",
    "description": "Place a barbell in a rack at about shoulder-height. Dip under the bar so that it rests behind the neck across the top of the back and shoulder blades, and grip the bar with the hands just outside the shoulders. Raise the chest and squeeze the shoulder blades together to maintain a straight back throughout the entire movement. Stand up to bring the bar off the rack and step backwards, placing both feet approximately hip-width apart and squarely set on the floor with the toes pointed forward. (Tip: for more development on the outside of calves point feet slightly inwards.) Keep a slight bend in knees, and press the toes into the ground while lifting the heels up. Pause at the top, and slowly roll the heels back down to the floor, then pause again and repeat for the desired number of repetitions. ",
    "bodyPart": "Legs - Calves and Shins",
    "category": ["Legs - Calves and Shins"],
    "equipment": "Barbell",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/51-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/51-2.jpg"
    ]
  },
  {
    "title": "Jump and Reach",
    "id": "14ec4d5f-1491-4b03-8968-86eae99cc88e",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Downward Phase: Begin your downward phase by first shifting your hips backwards then slowly moving downwards to create a hinge-like movement at your knees. Continue to lower yourself until your feel your heels about to lift off the floor. Try to maintain a flat back by bending forward at the hips, keep your head facing forward and position to your arms where comfortable or where they offer the greatest degree of balance support.  Extend your shoulders and reach your arms behind you to prepare the arm swing forward and upwards which will help with the upward momentum of the jump."
      },
      {
        "title": "Step 2",
        "description": "Jumping Movement: With ONLY a very brief pause at the bottom of your downward phase, explode upwards through your lower extremity, achieving triple extension (pushing and extending your ankles, knees and hips simultaneously). As you jump into the air, keep your feet level with each other and parallel with the floor as you explode your arms forward and throw them up in the air reaching overhead to help create upwards momentum away from the ground."
      },
      {
        "title": "Step 3",
        "description": "Extend all the way through the body to create a straight line from your toes up through you arms and out of your hands.  When landing, land on the mid-foot rolling backwards towards the heels.  Push your hips backwards and downwards to absorb the impacting (ground) forces associated with landing.  Attempt to land softly and quietly and avoid locking out your knees on the landing as this may lead to potential knee injuries."
      },
      {
        "title": "Step 3",
        "description": "Extend all the way through the body to create a straight line from your toes up through you arms and out of your hands.  When landing, land on the mid-foot rolling backwards towards the heels.  Push your hips backwards and downwards to absorb the impacting (ground) forces associated with landing.  Attempt to land softly and quietly and avoid locking out your knees on the landing as this may lead to potential knee injuries."
      },
      { "title": null, "description": "" },
      {
        "exerciseTip": "Before jumping become familiar with the movement mechanics by doing a few squats where you squat back into your heels and sink into your hips with your arms extended behind you, stand up from the squat while swinging your arms forward and roll up on your toes, then sink back into your heels; repeat for 4-6 repetitions."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Calves and Shins, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Calves and Shins", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/176-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/176-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/176-3.jpg"
    ]
  },
  {
    "title": "Lateral Cone Jumps",
    "id": "9a778fff-f1df-4418-9f5c-47545d7e7a66",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Place a series of cones 18-24\" apart in a straight line on a non-slip surface. Stand 3-6\" to your left of the first cone with your feet hip-width apart or closer, arms by your sides. Depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Begin your downward phase by first shifting your hips backwards then slowly moving downwards to create a hinge-like movement at your knees. Continue to lower yourself until your feel your heels about to lift off the floor. Try to maintain a flat back by bending forward at the hips. Keep your head facing forward or to the floor, and position your arms where comfortable or where they offer the greatest degree of balance support."
      },
      {
        "title": "Step 3",
        "description": "Jumping Movement: With ONLY a very brief pause at the bottom of your downward phase, explode sideways (left) and upwards through your lower extremity over the top of the first cone, achieving triple extension (pushing and extending your ankles, knees and hips simultaneously). As you jump into the air, try to keep your feet level with each other and parallel with the floor."
      },
      {
        "title": "Step 4",
        "description": "Landing: The most important components of the landing phase are correct foot position and avoiding excessive forward movement in your lower extremity which places additional stresses upon your knees."
      },
      {
        "title": "Step 5",
        "description": "Attempt to land softly and quietly on the mid-foot, rolling backwards quickly towards the heels to create a level foot, parallel with the floor. Always push your hips backwards and drop your hips to absorb the jumping forces. Avoid locking your knees or quads on your landing as this may lead to potential knee injuries."
      },
      {
        "exerciseTip": "Learn first how to squat and perform regular squat jumps before attempting to jump laterally."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Calves and Shins, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Calves and Shins", "Legs - Thighs"],
    "equipment": "Cones",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/120-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/120-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/120-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/120-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/120-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/120-6.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/120-7.jpg"
    ]
  },
  {
    "title": "Kneeling TA Stretch",
    "id": "4ebf2047-474e-40a0-bd13-ffb83703f5d7",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Kneeling on both knees, hip-width apart, with your feet in plantar flexion (pointing backwards) and arms by your side, elongate the body reaching the head towards the ceiling.  Stiffen your abdominal muscles (“brace”) to stabilize your spine, then depress and retract your scapulae (pull shoulders down and back) without arching your low back. Hold your chest up and out, and tilt your head slightly up."
      },
      {
        "title": "Step 2",
        "description": "Shift your weight backwards, bringing your glutes to your heels, while maintaining “bracing.” Keeping your arms close to your sides, allow your arms to move behind you, placing your fingertips lightly on the floor for support.  Hold the stretch for 15-30 seconds for 2-4 repetitions."
      },
      { "title": null, "description": null },
      { "title": null, "description": null },
      { "title": null, "description": null },
      {
        "exerciseTip": "Move into position slowly and controlled to avoid dropping all of your weight straight down onto your heels.  Should you have any knee discomfort, come out of the stretch position slowly and do not repeat the stretch."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Thighs"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/195-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/195-2.jpg"
    ]
  },
  {
    "title": "Lateral Shuffles",
    "id": "bbb931a7-3446-43e4-8350-04f15cc72c6e",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Set out cones approximately 5 yards apart, stand at the far left cone in an athletic ready position: feet hip-width apart, knees bent with your weight back in your flexed hips.  Engage the abdominals (bracing) to maintain spinal stability throughout the exercise."
      },
      {
        "title": "Step 2",
        "description": "Maintain the athletic ready position with your hips bent, your chest over your knees and your nose over your toes with your weight balanced between being up on the balls of your feet and back in your hips; shift your weight towards your right and pick up your right foot while explosively pushing your left foot into the ground to start moving to your right."
      },
      {
        "title": "Step 3",
        "description": "Maintain the athletic ready position while continuing to move to your right, picking up the right foot and placing it to the right while pushing the left foot into the ground to generate the force and momentum for the sideways movement.  Your feet should remain parallel with one another with the toes facing foward and your weight on the balls of your feet (keep the whole foot on the ground, but your weight should be forward over the front of your feet); the emphasis of this drill should be on rapid, quick foot actions for the sideways (lateral) shuffling."
      },
      {
        "title": "Step 4",
        "description": "At the far cone maintain the athletic ready position while shifting your weight over your left leg and push off with the right foot to begin shuffling back to the original starting point.  As you shuffle back to your left, pick up the left foot and place it to the left while pushing offer with the right foot.  Ensure that your feet remain parallel with your toes pointing forward and focus on rapid, quick foot actions for the duration of the movement."
      },
      {
        "title": "Step 5",
        "description": "Exercise Variation: Work with a coach or training partner to provide either visual cues: by signaling which direction to move with a hand gesture, e.g. pointing to the left to shuffle to the left; or verbal cues: by stating which direction to shuffle, e.g. stating \"right\" to shuffle to the right."
      },
      {
        "exerciseTip": "Maintain a wide base of support, as you shuffle your feet should remain at least hip-width apart to maintain dynamic balance as you move over the ground."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Thighs"],
    "equipment": "Cones",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/181-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/181-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/181-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/181-4.jpg"
    ]
  },
  {
    "title": "Diagonal Raise",
    "id": "157e7bdf-abbd-4650-963b-5d5d07e7337a",
    "description": "Stand with the feet hip-width apart, hold one dumbbell in the left hand with the left arm down straight and the left palm resting in front of the right thigh. Press the feet into the ground, keep the hips straight and the back tall. Raise the left arm across the body and out to the left side so that the weight is brought up to shoulder-height and the arm is kept straight.",
    "bodyPart": "Shoulders",
    "category": ["Shoulders"],
    "equipment": "Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/371-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/371-2.jpg"
    ]
  },
  {
    "title": "Front Raise",
    "id": "e497e9da-2df7-4a3b-86a1-e9564f5fcd2e",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Stand holding dumbbells in front of you thighs using a closed, pronated grip (thumbs around the handles and palms facing your thighs). Position the dumbbells lightly touching the fronts of your thighs with your elbows extended or holding a slight bend. Assume either a split-stance position to stabilize your body or position your feet slightly wider than hip-width apart."
      },
      {
        "title": "Step 2",
        "description": "Stiffen your torso by contracting your abdominal/core muscles (\"bracing\"), and depress and retract your scapulae (pull your shoulders down and back), maintaining this position throughout the exercise. Your head position should be aligned with your spine."
      },
      {
        "title": "Step 3",
        "description": "Upward Phase: Exhale and slowly raise the dumbbells up in front of your body. Your elbows and upper arms should rise together and be slightly ahead of your forearms and dumbbells. As your arms move past 60 - 70 degrees (nearing shoulder level), slowly rotate them upwards somewhat so that the inside edge of the dumbbells point slightly upwards. Continue raising the dumbbells until your arms are level with your shoulders and approximately parallel with the floor. Maintain an erect torso (no arching of your low back) and neutral wrist position (avoid flexion and extension of your wrists)."
      },
      {
        "title": "Step 4",
        "description": "Downward Phase: Inhale and gently lower the dumbbells back towards your starting position keeping your elbows slightly extended. Maintain your foot, torso, shoulder and wrist positions while lowering the dumbbells and rotating them slightly inwards as your arms pass that 60-70 degree mark."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Traditionally, this exercise positions the arms into internal rotation during the lift, so the slight external rotation initiated at the 60-70 degree mark may reduce potential impingement in the shoulder joint."
      }
    ],
    "bodyPart": "Shoulders",
    "category": ["Shoulders"],
    "equipment": "Dumbbells",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/54-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/54-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/54-3.jpg"
    ]
  },
  {
    "title": "High Plank T-spine Rotation",
    "id": "d5ae152b-d03e-4cd7-927e-9576fe60f499",
    "description": "Start in a push-up position with hands under the shoulders and the legs straightened directly behind the body about hip-width apart. Squeeze the thighs and glutes while straightening the right arm and pressing it into the floor. At the same time, lift the left hand up and twist the hips and shoulders to raise the left arm up towards the ceiling. Bring the left arm down, press the left hand into the floor, and twist the hips and shoulders to alternate sides, lifting the right hand into the air. Repeat for the desired number of repetitions.",
    "bodyPart": "Abs, Shoulders",
    "category": ["Abs", "Shoulders"],
    "equipment": "No Equipment",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/330-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/330-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/330-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/330-4.jpg"
    ]
  },
  {
    "title": "Rotator Cuff External Rotation",
    "id": "17d02578-4538-43ac-adc4-ec411683b533",
    "description": "Place a cable pulley at about waist-height and attach a single handle, holding it in the left hand so that the right side of the body is closest to the machine. Keep the left elbow tucked in to the body, and turn the shoulder back away from the body to move the left hand to the outside of the body (the cable should pass in front of the stomach). Pause for one second before slowly lowering the weight to the starting position. ",
    "bodyPart": "Shoulders",
    "category": ["Shoulders"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/352-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/352-2.jpg"
    ]
  },
  {
    "title": "Rotator Cuff Internal Rotation",
    "id": "569b4dc1-8115-4c9e-89ac-39239fe9b928",
    "description": "Place a cable pulley at about waist-height, and attach a single handle holding it in the right hand with the right side of body closest to the machine. Keep the right elbow tucked in to the body, and rotate the shoulder forward to bring the right hand to the front of stomach. Pause for one second before slowly lowering the weight, still keeping elbow close to the body.",
    "bodyPart": "Shoulders",
    "category": ["Shoulders"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/351-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/351-2.jpg"
    ]
  },
  {
    "title": "Stability Ball Pikes",
    "id": "4cb0940e-31df-4da9-a3ca-a63bb77f2842",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie prone (on your stomach) over the top of a properly-inflated stability ball (one that compresses approximately 6\" under your body weight) with both feet and hands on the floor, hip- and shoulder-width apart."
      },
      {
        "title": "Step 2",
        "description": "Gently exhale, contract your abdominal/core muscles to stiffen your torso and slowly walk yourself forward, lifting your legs off the floor. Continue walking out until your toes, with ankles in dorsiflexion (toes pointed towards your shins), rest on the top of the ball. Maintain a rigid torso aligned parallel with your legs. Retract and depress your scapulae (pull your shoulder back and down) as your reach your end position, with your arms fully extended and hands positioned directly under your shoulders."
      },
      {
        "title": "Step 3",
        "description": "Curling Phase: Exhale and while keeping your legs fully extended, pull your feet towards towards your chest, rolling the ball forward as your hips move upwards (think about lifting your rear end towards the ceiling while hinging at the hips). Continue moving until you reach an inverted position where your hips are positioned directly above your shoulders, with your legs, torso and arms fully extended, and head positioned between your arms. Your toes should remain on the top of the ball, but your ankles can move into plantar flexion (toes pointed away from your shins)."
      },
      {
        "title": "Step 4",
        "description": "Lowering Phase: Inhale and slowly lower yourself back towards the floor, returning your body to the starting position."
      },
      { "title": null, "description": null },
      {
        "exerciseTip": "Avoid arching (sagging) your lower back or hiking your hips upwards in the starting position. Contract your abdominal, back and glute muscles to keep your torso and legs parallel to the floor."
      }
    ],
    "bodyPart": "Abs, Shoulders",
    "category": ["Abs", "Shoulders"],
    "equipment": "Stability Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/61-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/61-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/61-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/61-4.jpg"
    ]
  },
  {
    "title": "Stability Ball Shoulder Stabilization",
    "id": "41aa08c5-087f-42c1-ac52-d17f592a376d",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Lie prone (on your stomach) over the top of a properly-inflated stability ball (one that compresses approximately 6\" under your body weight) with both feet and hands on the floor, hip- and shoulder-width apart."
      },
      {
        "title": "Step 2",
        "description": "Gently contract your abdominal/core muscles to stiffen your torso and slowly walk backwards until your stomach lies directly over the top of the ball with both legs extended and both feet firmly placed on the floor, hip-width or wider apart. Your torso and legs should be in parallel alignment with your arms, resting on the ball."
      },
      {
        "title": "Step 3",
        "description": "Start with your scapulae in a retracted and depressed position (shoulders pulled down and back) without any arching in the low back while performing the formations listed in the subsequent steps."
      },
      {
        "title": "Step 4",
        "description": "\"I\" Formation: Exhale, fully extend both arms and slowly raise them overhead (in line with your torso) in unison until they lie level with your torso. Your thumbs should point towards the ceiling (palms facing each other). Avoid any shrugging in your shoulders. Hold this position briefly, inhale and slowly return your arms to their starting position"
      },
      {
        "title": "Step 5",
        "description": "\"Y\" Formation: Exhale, fully extend both arms and slowly raise them in unison at a 45 degree angle from overhead until both lie level with your torso. Your thumbs should point towards the ceiling. Avoid any shrugging in your shoulders. Hold this position briefly, inhale and slowly return your arms to their starting position."
      },
      {
        "exerciseTip": "Avoid hyperextension in your low back by raising your torso past parallel alignment with your legs."
      }
    ],
    "bodyPart": "Back, Shoulders",
    "category": ["Back", "Shoulders"],
    "equipment": "Stability Ball",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/67-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/67-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/67-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/67-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/67-5.jpg"
    ]
  },
  {
    "title": "High Row",
    "id": "599d6535-235a-4005-a942-75df885cfc1a",
    "description": "Stand with the feet hip-width apart, the hips straight, the back tall, and the knees slightly bent. Place the cable pulley at about shoulder-height, attach a rope handle, and hold one end of the rope in each hand with the palms facing down. Turn to face the machine. Lift the chest up and pull the elbows back until the hands are right in front of the shoulders, then pause for 2-3 seconds. Slowly straighten the arms to return the weight to the starting position. ",
    "bodyPart": "Back",
    "category": ["Back"],
    "equipment": "Resistance Bands/Cables",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/336-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/336-2.jpg"
    ]
  },
  {
    "title": "Forward Cone Jumps",
    "id": "fdef7311-57ae-4344-b394-1dfa3ce8b403",
    "description": [
      {
        "title": "Step 1",
        "description": "Starting Position: Place a series of cones 18-24\" apart in a straight line on a non-slip surface. Stand 6\" behind the first cone with your feet hip-width apart or closer, arms by your sides. Depress and retract your scapulae (pull your shoulders down and back) without arching your low back, and \"brace\" (engage your abdominal / core muscles) to stiffen your spine."
      },
      {
        "title": "Step 2",
        "description": "Downward Phase: Begin your downward phase by first shifting your hips backwards then slowly moving downwards to create a hinge-like movement at your knees. Continue to lower yourself until your feel your heels about to lift off the floor. Try to maintain a flat back by bending forward at the hips. Keep your head facing forward or to the floor, and position your arms where comfortable or where they offer the greatest degree of balance support."
      },
      {
        "title": "Step 3",
        "description": "Jumping Movement: With ONLY a very brief pause at the bottom of your downward phase, explode forward and upwards through your lower extremity over the top of the first cone, achieving triple extension (pushing and extending your ankles, knees and hips simultaneously). As your jump into the air, try to keep your feet level with each other and parallel with the floor."
      },
      {
        "title": "Step 4",
        "description": "Landing: The most important components of the landing phase are correct foot position and avoiding excessive forward movement in your lower extremity which places additional stresses upon your knees."
      },
      {
        "title": "Step 5",
        "description": "Attempt to land softly and quietly on the mid-foot, rolling backwards quickly towards the heels to create a level foot, parallel with the floor. Always push your hips backwards and drop your hips to absorb the jumping forces. Avoid locking your knees or quads on your landing as this may lead to potential knee injuries."
      },
      {
        "exerciseTip": "Learn first how to squat and perform regular squat jumps before attempting to jump the cones."
      }
    ],
    "bodyPart": "Butt/Hips, Legs - Thighs",
    "category": ["Butt/Hips", "Legs - Thighs"],
    "equipment": "Cones",
    "images": [
      "https://acewebcontent.azureedge.net/exercise-library/large/118-1.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-2.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-3.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-4.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-5.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-6.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-7.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-8.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-9.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-10.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-11.jpg",
      "https://acewebcontent.azureedge.net/exercise-library/large/118-12.jpg"
    ]
  }
]
